{
  "relation2id": {
    "<PAD>": 0,
    "operator": 1,
    "state": 2,
    "fragmentation": 3
  },
  "concept2id": {
    "<PAD>": 0,
    "Object": 1,
    "RocketBodyObjClass": 2,
    "PayloadObjClass": 3,
    "PayloadMissionRelatedObjectObjClass": 4,
    "RocketMissionRelatedObjectObjClass": 5,
    "RocketFragmentationDebrisObjClass": 6,
    "PayloadFragmentationDebrisObjClass": 7,
    "PayloadDebrisObjClass": 8,
    "RocketDebrisObjClass": 9,
    "UnknownObjClass": 10,
    "OtherDebrisObjClass": 11,
    "OtherMissionRelatedObjectObjClass": 12
  },
   "function2id": {
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "FindAll": 3,
    "FilterStr": 4,
    "FilterConcept": 5,
    "And": 6,
    "What": 7,
    "Find": 8,
    "QueryAttrQualifier": 9,
    "Relate": 10,
    "QueryAttr": 11,
    "VerifyStr": 12,
    "FilterNum": 13,
    "SelectBetween": 14,
    "QueryRelationQualifier": 15,
    "QueryRelation": 16,
    "Count": 17,
    "VerifyNum": 18,
    "VerifyYear": 19,
    "FilterYear": 20,
    "SelectAmong": 21,
    "FilterDate": 22,
    "QueryAttrUnderCondition": 23,
    "QFilterYear": 24,
    "QFilterStr": 25,
    "Or": 26,
    "QFilterNum": 27,
    "QFilterDate": 28,
    "VerifyDate": 29
  },
  "entity2id": {
    "<PAD>": 0,
    "Sputnik (8K71PS) Blok-A": 1,
    "Sputnik 1": 2,
    "Sputnik 2": 3,
    "Explorer 1": 4,
    "Vanguard 1": 5,
    "Explorer 3": 6,
    "Sputnik (8A91) Blok-A": 7,
    "Sputnik 3": 8,
    "Explorer 4": 9,
    "Score": 10,
    "Vanguard 2": 11,
    "Grand Central (ALB) (Vanguard)": 12,
    "Discoverer 1": 13,
    "Discoverer 2": 14,
    "Explorer 6": 15,
    "Altair 1 (Thor-Able)": 16,
    "Discoverer 5": 17,
    "Discoverer 6": 18,
    "Vanguard 3": 19,
    "Luna 3": 20,
    "Explorer 7": 21,
    "SERGEANT_1 (Juno II)": 22,
    "Discoverer 7": 23,
    "Discoverer 8": 24,
    "Discoverer 5 Satellite Return Vehicle": 25,
    "Pioneer 5": 26,
    "Tiros I": 27,
    "Able-Star (Thor-Ablestar)": 28,
    "Transit 1B": 29,
    "Discoverer 11": 30,
    "Thor Ablestar operational debris": 31,
    "Korabl-Sputnik 1 (Sputnik 4) propulsion module": 32,
    "Vostok 8A92M-2 (Vostok SL-3 (A-1))": 33,
    "Korabl-Sputnik 1 (Sputnik 4) cabin": 34,
    "Sputnik 4 operational debris": 35,
    "Midas 2": 36,
    "Atlas LV-3A Agena A nose-cap": 37,
    "Transit 2A": 38,
    "Greb": 39,
    "Discoverer 13": 40,
    "Echo I": 41,
    "ALTAIR 1 (Delta)": 42,
    "Echo I metal object": 43,
    "Echo I mylar object": 44,
    "Discoverer 14": 45,
    "Sputnik 5": 46,
    "Discoverer 15": 47,
    "Courier 1B": 48,
    "Explorer 8": 49,
    "Discoverer 17": 50,
    "Tiros II": 51,
    "Sputnik 6": 52,
    "Discoverer 18": 53,
    "Discoverer 19": 54,
    "Juno II operational debris": 55,
    "Samos-2 F-1": 56,
    "Sputnik 7": 57,
    "Blok-I (Molniya)": 58,
    "Molniya operational debris (jettisonable engine section (BOZ))": 59,
    "Delta operational debris": 60,
    "Molniya operational debris": 61,
    "Venera 1": 62,
    "Explorer 9": 63,
    "Altair 1A (Scout X-1)": 64,
    "Discoverer 20": 65,
    "Discoverer 21": 66,
    "Scout X-1 operational debris": 67,
    "Transit 3B - Lofti 1": 68,
    "Discoverer 20 operational debris": 69,
    "Sputnik 9": 70,
    "Sputnik 9 operational debris": 71,
    "Sputnik 10": 72,
    "Vostok operational debris": 73,
    "Explorer 10": 74,
    "Discoverer 23": 75,
    "Thor Able (3 stage) operational debris (yo-yo weight)": 76,
    "Discoverer 23 Satellite Return Vehicle": 77,
    "Vostok 1": 78,
    "Discoverer 23 operational debris": 79,
    "Explorer 11": 80,
    "Discoverer 25": 81,
    "Discoverer 25 operational debris": 82,
    "Pioneer 1": 83,
    "Pioneer 3": 84,
    "Luna 1": 85,
    "Pioneer 4": 86,
    "Luna 2": 87,
    "Transit 4A (NPP)": 88,
    "Injun 1 - Solrad 3": 89,
    "Thor Ablestar fragmentation debris": 90,
    "Discoverer 26": 91,
    "Tiros III": 92,
    "Midas 3": 93,
    "Atlas LV-3A Agena B nose-cap": 94,
    "Delta operational debris (yo-yo weight)": 95,
    "Vostok 2": 96,
    "Explorer 12": 97,
    "Ranger 1": 98,
    "Agena B (Atlas LV-3A Agena B)": 99,
    "Explorer 13": 100,
    "Discoverer 29": 101,
    "Discoverer 30": 102,
    "Mercury Atlas 4": 103,
    "ATLASD (Atlas D)": 104,
    "Discoverer 30 operational debris": 105,
    "Discoverer 31": 106,
    "Midas 3 operational debris (solar array cover)": 107,
    "Discoverer 32": 108,
    "Discoverer 32 operational debris": 109,
    "Midas 4": 110,
    "Midas 4 operational debris (West Ford dispenser)": 111,
    "Midas 4 operational debris (West Ford package fragment)": 112,
    "Discoverer 34": 113,
    "Discoverer 34 operational debris": 114,
    "Discoverer 35": 115,
    "Transit 4B (NPP)": 116,
    "TRAAC": 117,
    "Ranger 2": 118,
    "Discoverer 35 operational debris": 119,
    "Mercury Atlas 5": 120,
    "Discoverer 36": 121,
    "OSCAR 1": 122,
    "Discoverer 36 operational debris (inst. cover)": 123,
    "Samos 5 Reflector": 124,
    "Samos 5 (includes RV)": 125,
    "Ranger 3": 126,
    "Tiros IV": 127,
    "Mercury Atlas 6": 128,
    "NNN (00242)": 129,
    "Discoverer 38": 130,
    "Discoverer 38 operational debris": 131,
    "OSO 1": 132,
    "Samos 6 (includes RV)": 133,
    "Samos-6 reflector": 134,
    "Cosmos-1": 135,
    "COSMOS A-2 (Cosmos 2I (63S1))": 136,
    "Cosmos-2": 137,
    "Midas 5": 138,
    "Midas 5 operational debris": 139,
    "NNN (00276)": 140,
    "NNN (00276) operational debris": 141,
    "Ranger 4": 142,
    "Cosmos-3": 143,
    "Ariel I": 144,
    "Samos-7": 145,
    "Cosmos-4": 146,
    "NNN (00290)": 147,
    "NNN (00290) operational debris": 148,
    "NNN (00292)": 149,
    "NNN (00292) operational debris": 150,
    "Mercury Atlas 7": 151,
    "Cosmos-5": 152,
    "NNN (00302)": 153,
    "NNN (00302) operational debris": 154,
    "NNN (00304)": 155,
    "OSCAR 2": 156,
    "NNN (00304) operational debris": 157,
    "Samos-8": 158,
    "NNN (00308)": 159,
    "Tiros V": 160,
    "NNN (00308) operational debris": 161,
    "NNN (00315)": 162,
    "NNN (00316)": 163,
    "Cosmos-6": 164,
    "Telstar 1": 165,
    "Samos-9": 166,
    "NNN (00344)": 167,
    "NNN (00345)": 168,
    "Cosmos-7": 169,
    "NNN (00360)": 170,
    "Samos-10": 171,
    "NNN (00360) operational debris": 172,
    "Vostok 3": 173,
    "Vostok 4": 174,
    "Cosmos-8": 175,
    "P-35B": 176,
    "Scout X-2M operational debris": 177,
    "Sputnik 19": 178,
    "Mariner 2": 179,
    "NNN (00377)": 180,
    "Sputnik 20": 181,
    "NNN (00385)": 182,
    "Altair 1A (Scout X-2)": 183,
    "Sputnik 21": 184,
    "NNN (00396) (ERS 2)": 185,
    "Tiros VI": 186,
    "Delta operational debris (yo-yo weight) yo": 187,
    "Cosmos-9": 188,
    "Alouette 1": 189,
    "Agena B (Thor-Agena B)": 190,
    "NNN (00427)": 191,
    "Explorer 14": 192,
    "Mercury Atlas 8": 193,
    "NNN (00436)": 194,
    "Cosmos-10": 195,
    "Ranger 5": 196,
    "Cosmos-11": 197,
    "Sputnik 22": 198,
    "Starad": 199,
    "Explorer 15": 200,
    "ANNA 1B": 201,
    "Mars 1": 202,
    "Sputnik 24": 203,
    "NNN (00453)": 204,
    "Samos-11": 205,
    "Sputnik 22 fragmentation debris": 206,
    "NNN (00481)": 207,
    "NNN (00490)": 208,
    "NNN (00502)": 209,
    "Relay 1": 210,
    "Injun 3": 211,
    "NNN (00505)": 212,
    "Explorer 16": 213,
    "Surcal 1": 214,
    "Surcal 1A": 215,
    "Transit 5A": 216,
    "Thor Agena B operational debris": 217,
    "Calsphere 1A": 218,
    "Scout X-3 operational debris (yo-yo weight)": 219,
    "Altair 1 (Delta B)": 220,
    "Cosmos-12": 221,
    "Altair 1A (Scout X-3)": 222,
    "Agena B (Thor-Agena D)": 223,
    "E-6 No. 2 (failed Luna-4)": 224,
    "KH-4 18 (Corona 59 - OPS 0048)": 225,
    "NNN (00525) operational debris": 226,
    "Samos-F2 3 (OPS 0180)": 227,
    "NNN (00527) operational debris": 228,
    "DSAP-1 F3 (P-35C - OPS 0240 - FTV 0240)": 229,
    "Scout X-3M operational debris": 230,
    "Syncom 1": 231,
    "Cosmos-13": 232,
    "KH-4 20 (Corona 62 - OPS 0720)": 233,
    "Explorer 17": 234,
    "Luna 4": 235,
    "Cosmos-14": 236,
    "Cosmos-15": 237,
    "Cosmos-16": 238,
    "Telstar 2": 239,
    "Midas 6": 240,
    "Mercury Atlas 9": 241,
    "KH-6 2 (Lanyard 2 - Corona 64 - OPS 0924 - FTV 1110)": 242,
    "TRS 5": 243,
    "Cosmos-17": 244,
    "Cosmos-2I (63S1) operational debris": 245,
    "Cosmos-18": 246,
    "DASH 1": 247,
    "KH-4 21 (Corona 65 - OPS 0954)": 248,
    "Vostok 5": 249,
    "Transit 7": 250,
    "Vostok 6": 251,
    "Surcal 1B": 252,
    "Poppy 2B (NRL-PL 130)": 253,
    "Solrad 6 (Poppy 2A - NRL-PL 110)": 254,
    "Radose (Poppy 2C - NRL-PL 112)": 255,
    "Lofti 2A": 256,
    "Midas solar array cover": 257,
    "Tiros VII": 258,
    "Tiros VII operational debris (despin weight)": 259,
    "TRS 6": 260,
    "KH-4A 22 (Corona 66": 261,
    "Scout X-3 operational debris": 262,
    "GRS": 263,
    "Samos-F2 4 (OPS 1440)": 264,
    "Hitch-hiker 1": 265,
    "TAT Agena B operational debris": 266,
    "Thor Agena D operational debris": 267,
    "KH-7 1 (Gambit-1 1 - OPS 1467)": 268,
    "Atlas LV-3A Agena D operational debris": 269,
    "Agena D (Atlas LV-3A Agena D)": 270,
    "KH-4A 23 (Corona 67 - OPS 1266)": 271,
    "Midas 7 + Atlas LV-3A Agena B stage 2 (Agena B)": 272,
    "DASH 2": 273,
    "KH-6 3 (Lanyard 3 - Corona 68 - OPS 1370)": 274,
    "TAT Agena D operational debris": 275,
    "Westford needles": 276,
    "Midas-7 operational debris (solar array cover)": 277,
    "Cosmos-19": 278,
    "Syncom 2": 279,
    "ERS 9": 280,
    "KH-4A 1 (Corona 69 - OPS 1419)": 281,
    "KH-5 9": 282,
    "Lampo (0.1 Square Meter Target)": 283,
    "KH-5 operational debris": 284,
    "KH-7 2 (Gambit-1 2 - OPS 1947)": 285,
    "TAT Agena D operational debris (fairing adapter)": 286,
    "KH-7 operational debris": 287,
    "KH-4A 2 (Corona 71 - OPS 1353)": 288,
    "Transit 5B-1 (NPP)": 289,
    "SN 39": 290,
    "Cosmos-20": 291,
    "Vela 2": 292,
    "ERS 12": 293,
    "KH-7 3 (Gambit-1 3 - OPS 2196)": 294,
    "KH-5 10": 295,
    "Hitch-hiker 2": 296,
    "Polyot 1": 297,
    "Polyot 1 operational debris": 298,
    "Cosmos-21 + stage 4 fully fuelled": 299,
    "Cosmos-22": 300,
    "Blok-I (Soyuz SL-4 (A-2))": 301,
    "Vela 1": 302,
    "Explorer 18": 303,
    "CENTAUR C (Atlas LV3C)": 304,
    "KH-4 25 (Corona 74": 305,
    "Atlas LV-3C Centaur D operational debris (payload fairing)": 306,
    "Atlas LV-3C Centaur D fragmentation debris": 307,
    "Transit 5B-2 (NPP)": 308,
    "Transit 5E-3": 309,
    "Cosmos-23": 310,
    "KH-7 4 (Gambit-1 4 - OPS 2372)": 311,
    "Cosmos-24": 312,
    "Explorer 19": 313,
    "Tiros VIII": 314,
    "KH-4 26 (Corona 75 - OPS 1388)": 315,
    "Hitch-hiker 3": 316,
    "Delta B operational debris (despin weight)": 317,
    "Altair 2 (Scout X-4)": 318,
    "Scout X-4 operational debris": 319,
    "GGSE 1": 320,
    "Secor 1 (EGRS 1)": 321,
    "Solrad 7A": 322,
    "Greb 5": 323,
    "OPS 3367A": 324,
    "OPS 3367B": 325,
    "Relay 2": 326,
    "Echo II": 327,
    "Saturn IV": 328,
    "Elektron 1": 329,
    "Ranger 6": 330,
    "Elektron 2": 331,
    "Thor Agena B operational debris (Shroud Half)": 332,
    "Elektron 1 debris": 333,
    "KH-4A 3 (Corona 76 - OPS 3444)": 334,
    "KH-7 5 (Gambit-1 5 - OPS 2423)": 335,
    "KH-4A 3 operational debris (Fairing Adapter)": 336,
    "Atlas LV-3A Agena D stage 2 (Agena D)": 337,
    "Cosmos-25": 338,
    "Samos-F3 1 (OPS 3722)": 339,
    "OPS 3722 operational debris": 340,
    "KH-7 6 (Gambit-1 6 - OPS 3435)": 341,
    "Cosmos-26": 342,
    "Ariel II": 343,
    "Cosmos-27": 344,
    "Molniya-M Block L operational debris": 345,
    "Cosmos-28": 346,
    "Gemini 1": 347,
    "Polyot 2 operational debris": 348,
    "Polyot 2": 349,
    "Zond 1": 350,
    "KH-7 7 (Gambit-1 7 - OPS 3743)": 351,
    "KH-7 (00786) operational debris": 352,
    "Cosmos-29": 353,
    "KH-4A 5 (Corona 78 - OPS 2921)": 354,
    "Cosmos-30": 355,
    "KH-7 8 (Gambit-1 8 - OPS 3592)": 356,
    "Saturn SA-6": 357,
    "Transit 5C": 358,
    "KH-4A 6 (Corona 79 - OPS 3483)": 359,
    "Cosmos-31": 360,
    "Cosmos-32": 361,
    "KH-5 11": 362,
    "DSAP-1 F8 (P-35 8 - OPS 4467A)": 363,
    "DSAP-1 F9 (P-35 9": 364,
    "KH-4A 7 (Corona 81 - OPS 3754)": 365,
    "Cosmos-33": 366,
    "Starflash 1A operational debris": 367,
    "KH-4A operational debris (fairing)": 368,
    "Cosmos-34": 369,
    "OPS 3395 (Samos-F3 2)": 370,
    "KH-7 9 (Gambit-1 9 - OPS 3684)": 371,
    "OPS 4923 (P-11 4301)": 372,
    "OPS 4923 operational debris": 373,
    "KH-4A 8 (Corona 82 - OPS 3491)": 374,
    "Elektron 3": 375,
    "Elektron 4": 376,
    "Elektron 3 operational debris": 377,
    "Cosmos-35": 378,
    "Vela 3": 379,
    "Vela 4": 380,
    "ERS 13": 381,
    "Ranger 7": 382,
    "Cosmos-36": 383,
    "KH-4A 9 (Corona 83 - OPS 3042)": 384,
    "Cosmos-37": 385,
    "KH-7 10 (Gambit-1 10 - OPS 3802)": 386,
    "OPS 3316 (Hitchhiker 2 - P-11 3)": 387,
    "Agena D (Atlas SLV3)": 388,
    "Cosmos-38": 389,
    "Cosmos-39": 390,
    "Cosmos-40": 391,
    "Cosmos 3 second stage (S3) (Cosmos 1 (65S3))": 392,
    "Cosmos-1 (65S3) operational debris": 393,
    "Syncom 3": 394,
    "KH-5 12": 395,
    "Altair 2 (Delta D)": 396,
    "Cosmos-42": 397,
    "Cosmos-43": 398,
    "Cosmos-41": 399,
    "Explorer 20": 400,
    "Nimbus 1": 401,
    "Cosmos-44": 402,
    "OGO 1": 403,
    "Cosmos-45": 404,
    "KH-4A 10 (Corona 85 - OPS 3497)": 405,
    "Saturn SA-7": 406,
    "KH-7 11 (Gambit-1 11 - OPS 4262)": 407,
    "Cosmos-46": 408,
    "KH-4A operational debris (Fairing)": 409,
    "Explorer 21 (IMP B)": 410,
    "KH-4A 11 (Corona 86 - OPS 3333)": 411,
    "Cosmos-47": 412,
    "Voskhod operational debris": 413,
    "NNS O-1 (Transit 5B-4 )": 414,
    "Blok-L (Molniya)": 415,
    "Explorer 22": 416,
    "Calsphere 1": 417,
    "Transit 5B-4 operational debris": 418,
    "Calsphere 2": 419,
    "Voskhod 1": 420,
    "Cosmos-48": 421,
    "Cosmos-48 operational debris": 422,
    "KH-4A 12 (Corona 87 - OPS 3559)": 423,
    "KH-7 13 (Gambit-1 13 - OPS 4384)": 424,
    "Cosmos-49": 425,
    "OPS 5063": 426,
    "KH-7 operational debris (SRV satellite recovery vehicle)": 427,
    "Cosmos-50": 428,
    "KH-4A 13 (Corona 88 - OPS 5434)": 429,
    "Samos-F3 3 (OPS 3062)": 430,
    "Mariner 3": 431,
    "Explorer 23": 432,
    "OPS 3062 operational debris": 433,
    "KH-4A 14 + Orbis (Corona 89": 434,
    "Explorer 24": 435,
    "Explorer 25": 436,
    "Mariner 4": 437,
    "Zond 2": 438,
    "KH-7 14 (Gambit-1 14": 439,
    "Cosmos-51": 440,
    "Transtage 1 (Titan IIIA)": 441,
    "NNS O-2 debris": 442,
    "San Marco 1": 443,
    "SN 43 (Transit VE-5)": 444,
    "KH-4A 15 (Corona 90 - OPS 3358)": 445,
    "Explorer 26": 446,
    "Quill 1 (OPS 3762 - FTV 2355)": 447,
    "NNS O-2 (Transit 5B-5)": 448,
    "Cosmos-52": 449,
    "KH-4A 16 (Corona 91 - OPS 3928)": 450,
    "DMSP 4A-F1 (OPS 7040)": 451,
    "OPS 7040 operational debris": 452,
    "Tiros IX": 453,
    "Altair 1 (Delta C)": 454,
    "KH-7 15 (Gambit-1 15 - OPS 4703)": 455,
    "Cosmos-53": 456,
    "OSO 2": 457,
    "Cosmos-50 fragmentation debris": 458,
    "Titan IIIA stage 3 (Transtage)": 459,
    "Transtage 3 (Titan IIIA)": 460,
    "LES 1": 461,
    "Pegasus 1": 462,
    "Ranger 8": 463,
    "Apollo Model 3": 464,
    "Cosmos-54": 465,
    "Cosmos-55": 466,
    "Cosmos-56": 467,
    "Cosmos-57": 468,
    "KH-4A 17 (Corona 92 - OPS 4782)": 469,
    "Cosmos-58": 470,
    "Cosmos-57 fragmentation debris": 471,
    "Cosmos-59": 472,
    "Voskhod operational debris (Volga airlock)": 473,
    "Secor 3 (EGRS 3)": 474,
    "GGSE 2": 475,
    "Cosmos-60 (Luna 5c) + fully fuelled Block L": 476,
    "KH-7 16 (Gambit-1 16 - OPS 4920)": 477,
    "Secor 2 (EGRS 2)": 478,
    "Atlas SLV-3 Agena D operational debris": 479,
    "Cosmos-61": 480,
    "Cosmos-62": 481,
    "Cosmos-63": 482,
    "Greb 6": 483,
    "Dodecapole 1": 484,
    "DMSP 4A-F2 (OPS 7353)": 485,
    "Voskhod 2": 486,
    "Thor Altair IA operational debris": 487,
    "Altair 3 (Thor-Altair)": 488,
    "Solrad 7B": 489,
    "GGSE 3": 490,
    "OSCAR 3": 491,
    "Ranger 9": 492,
    "Gemini 3": 493,
    "Titan-2-2 (Titan II Gemini)": 494,
    "NNSS 30030 (Transit-O 3 - OPS 7087)": 495,
    "Cosmos-64": 496,
    "KH-4A 18 (Corona 93": 497,
    "Surcal 2": 498,
    "KH-4A operational debris (CORONA Fairing)": 499,
    "Delta C operational debris (despin weight)": 500,
    "Snapshot (NPP) + Atlas SLV-3 Agena D stage 2": 501,
    "Secor 4 (EGRS 4)": 502,
    "Snapshot operational debris (Heat Shield)": 503,
    "Intelsat I F-1 (Early Bird)": 504,
    "Cosmos-65": 505,
    "Molniya 1-1": 506,
    "KH-7 17 (Gambit-1 17 - OPS 4983)": 507,
    "Explorer 27": 508,
    "OPS 6717": 509,
    "KH-4A 19 (Corona 94 - OPS 5023)": 510,
    "KH-7 (01327) operational debris": 511,
    "Cosmos-1 (65S3) fragmentation debris": 512,
    "OPS 6717 operational debris": 513,
    "Transtage 6 (Titan IIIA)": 514,
    "LES 2": 515,
    "LCS 1": 516,
    "Cosmos-66": 517,
    "Luna-5": 518,
    "OPS 5023 payload 2 (SRV 627)": 519,
    "KH-4A 20 (Corona 95 - OPS 8431)": 520,
    "DMSP 4A-F3 (OPS 8386)": 521,
    "Pegasus 2": 522,
    "Cosmos-67": 523,
    "Apollo Model 4": 524,
    "KH-7 18 (Gambit-1 18 - OPS 5236)": 525,
    "Explorer 28 (IMP 3)": 526,
    "Gemini 4": 527,
    "Luna-6": 528,
    "KH-4A 21 (Corona 96 - OPS 8425)": 529,
    "Snapshot fragmentation debris": 530,
    "Cosmos-68": 531,
    "Titan IIIC dummy payload": 532,
    "Transtage 7 (Titan IIIC)": 533,
    "Transit 5B-6 (NNS 30040 - OPS 8480)": 534,
    "Cosmos-69": 535,
    "OPS 6749": 536,
    "KH-7 19 (Gambit-1 19 - OPS 5501)": 537,
    "Thor Ablestar operational debris (NNS adapter)": 538,
    "OPS 6749 operational debris": 539,
    "Tiros X": 540,
    "Cosmos-70": 541,
    "Cosmos-71": 542,
    "Cosmos-72": 543,
    "Cosmos-73": 544,
    "Cosmos-74": 545,
    "Cosmos-75": 546,
    "Proton 1 operational debris (fairing)": 547,
    "OPS 8411 (Samos Ferret)": 548,
    "UR-500 second stage (Proton)": 549,
    "OPS 8411 operational debris": 550,
    "Zond-3": 551,
    "KH-4A 22 (Corona 97 - OPS 5543)": 552,
    "Vela 5": 553,
    "Vela 6": 554,
    "ERS 17": 555,
    "Cosmos-76": 556,
    "Proton 1": 557,
    "Pegasus 3": 558,
    "Apollo Model 5": 559,
    "Cosmos-77": 560,
    "KH-7 21 (Gambit-1 21 - OPS 5698)": 561,
    "OPS 6761": 562,
    "Altair 3 (Scout B-1)": 563,
    "Surveyor D-2": 564,
    "Thor Ablestar operational debris(NRL adapter)": 565,
    "Cosmos-78": 566,
    "Secor 5 (EGRS 5)": 567,
    "Dodecapole 2": 568,
    "Tempsat 1": 569,
    "KH-4A 23 (Corona 98 - OPS 7208)": 570,
    "Transit 5B-7 (OPS 8464)(NNN 0-5)": 571,
    "Navspasur Rod 1": 572,
    "Gemini 5": 573,
    "REP": 574,
    "Titan II Gemini operational debris": 575,
    "Calsphere 4": 576,
    "Thor Ablestar op debris(NRL adapter)(satno change from 1577)": 577,
    "Transit 5B-7 operational debris": 578,
    "Cosmos-79": 579,
    "Transit 5B-1 debris": 580,
    "Cosmos-80 (RTGPP)": 581,
    "Cosmos-81": 582,
    "Cosmos-82": 583,
    "Cosmos-83": 584,
    "Cosmos-84": 585,
    "Vanguard operational debris": 586,
    "Surcal 4 (satno reassigned in 1998 from 1521)": 587,
    "Cosmos-85": 588,
    "DMSP 4A-F4 (OPS 8068)": 589,
    "Thor Altair IA operational debris (yo-yo weight)": 590,
    "Cosmos-86 (RTGPP)": 591,
    "Cosmos-87": 592,
    "Cosmos-88": 593,
    "Cosmos-89": 594,
    "Cosmos-90": 595,
    "KH-4A 24 (Corona 100 - OPS 7221)": 596,
    "Cosmos-91": 597,
    "KH-7 22 (Gambit-1 22 - OPS 7208)": 598,
    "Luna 7": 599,
    "Blok-I (Molniya-M Blok-L)": 600,
    "OV1 2": 601,
    "KH-4A 25 (Corona 101 - OPS 5325)": 602,
    "OGO 2": 603,
    "Molniya 1-2": 604,
    "Molniya Block L operational debris": 605,
    "Titan IIIC fragmentation debris (Transtage 4)": 606,
    "Cosmos-92": 607,
    "Cosmos-93": 608,
    "COSMOS A-2 (Cosmos 2I (11K63))": 609,
    "Cosmos-2I (11K63) operational debris": 610,
    "Cosmos-94": 611,
    "KH-4A 26 (Corona 102 - OPS 2155)": 612,
    "KH-4A operational debris (LPARL experiment cover)": 613,
    "Titan IIIC debris (Transtage 4) - LCS 2": 614,
    "OV2 1, LCS 2 main fragment": 615,
    "Proton 2": 616,
    "Proton 2 operational debris (fairing)": 617,
    "Proton operational debris": 618,
    "Cosmos-95": 619,
    "Explorer 29": 620,
    "KH-7 23 (Gambit-1 23 - OPS 6232)": 621,
    "FW-4D (Delta E)": 622,
    "Venera 2": 623,
    "Venera 3": 624,
    "Explorer 30": 625,
    "Cosmos-95 debris": 626,
    "Cosmos-96 + fully fuelled Block L": 627,
    "Cosmos-97": 628,
    "Asterix (A 1)": 629,
    "Cosmos-98": 630,
    "Alouette 2": 631,
    "RUBIS (Diamant A)": 632,
    "Explorer 31": 633,
    "Thor Agena B operational debris (DME-A adapter petal)": 634,
    "Luna 8": 635,
    "Gemini 7": 636,
    "FR 1": 637,
    "KH-4A 27 (Corona 103 - OPS 7249)": 638,
    "Cosmos-99": 639,
    "Titan Transtage (Titan IIIC)": 640,
    "Gemini 6": 641,
    "Pioneer 6": 642,
    "Delta E": 643,
    "Cosmos-100": 644,
    "Gemini 7 adaptor module operational debris": 645,
    "Cosmos-101": 646,
    "Titan Transtage (OV2 3) (Titan IIIC)": 647,
    "Transit 10 (NNS O-6)": 648,
    "Altair 2 (Scout A-1)": 649,
    "KH-4A 28 (Corona 104 - OPS 4639)": 650,
    "Cosmos-102": 651,
    "Cosmos-103": 652,
    "LES 4": 653,
    "OSCAR 4": 654,
    "Cosmos-104": 655,
    "FR 1 operational debris (despin weight)": 656,
    "Diamant A operational debris": 657,
    "KH-7 24 (Gambit-1 24 - OPS 7253)": 658,
    "LES 3": 659,
    "Cosmos-105": 660,
    "Cosmos-106": 661,
    "Transit 11 (NNS O-7)": 662,
    "Luna 9": 663,
    "KH-4A 29 (Corona 105 - OPS 7291)": 664,
    "ESSA 1": 665,
    "Heavy Ferret C 2 (OPS 1439)": 666,
    "Cosmos-107": 667,
    "Blok-L (Molniya-M Blok-L)": 668,
    "Cosmos-108": 669,
    "OPS 1439 operational debris": 670,
    "OPS 1184 (KH-7 25, Gambit-1 25)": 671,
    "Scout X-4 expt. cover": 672,
    "OPS 3011 (Bluebell 2C)": 673,
    "OPS 3031 (Bluebell 2S)": 674,
    "Diapason 1A": 675,
    "Cosmos-109": 676,
    "OPS 3031 (Bluebell 2S) fragmentation debris": 677,
    "Cosmos-110": 678,
    "Delta C operational debris (ESSA 1 despin weight)": 679,
    "Scout A operational debris": 680,
    "ESSA 2": 681,
    "Thor Agena B operational debris (Alouette sep clamp)": 682,
    "Cosmos-111": 683,
    "KH-4A 30 (Corona 106": 684,
    "Gemini 8 Target": 685,
    "Gemini 8": 686,
    "Cosmos-112": 687,
    "KH-7 26 (Gambit-1 26 - OPS 0879)": 688,
    "KH-4A 30 operational debris (Fairing)": 689,
    "Cosmos-113": 690,
    "Gemini 8 Equipment Module": 691,
    "ESSA 1 op debris (despin weight)": 692,
    "Transit 12 (NNS O-8)": 693,
    "OV1-4": 694,
    "OV1-5 (BORE)": 695,
    "Boost motor (OV1 5)": 696,
    "Boost motor (OV1 4)": 697,
    "DMSP 4A-F6 (OPS 0340)": 698,
    "Luna 10": 699,
    "Molniya-M Block L operational debris (Otdelyaemiy otsek)": 700,
    "Cosmos-114": 701,
    "KH-4A 31 (Corona 107 - OPS 1612)": 702,
    "Surveyor Model 2": 703,
    "OAO 1": 704,
    "KH-7 27 (Gambit-1 27 - OPS 0910)": 705,
    "Cosmos-115": 706,
    "OV3 1": 707,
    "Molniya 1-3": 708,
    "Cosmos-116": 709,
    "Thor Agena B operational debris (DME-A adapter sep clamp)": 710,
    "Delta C operational debris": 711,
    "Cosmos-117": 712,
    "Cosmos-118": 713,
    "KH-7 28 (Gambit-1 28 - OPS 1950)": 714,
    "OPS 6785": 715,
    "Nimbus 2": 716,
    "Transit 13 (NNS O-9)": 717,
    "KH-4A 33 (Corona 109": 718,
    "Cosmos-119": 719,
    "Explorer 32": 720,
    "Surveyor 1": 721,
    "Gemini 9 Target B (ATDA)": 722,
    "ATLAS MA-5 (Atlas SLV3)": 723,
    "Gemini 9": 724,
    "KH-7 29 (Gambit-1 29 - OPS 1577)": 725,
    "OGO 3": 726,
    "Cosmos-120": 727,
    "OPS 1960": 728,
    "OV3 4": 729,
    "ERS 16": 730,
    "Secor 6 (EGRS 6)": 731,
    "GGTS 1": 732,
    "Scout B operational debris": 733,
    "Cosmos-121": 734,
    "OPS 9311 (IDSCS 1)": 735,
    "OPS 9312 (IDSCS 2)": 736,
    "OPS 9313 (IDSCS 3)": 737,
    "OPS 9314 (IDSCS 4)": 738,
    "OPS 9315 (IDSCS 5)": 739,
    "OPS 9316 (IDSCS 6)": 740,
    "OPS 9317 (IDSCS 7)": 741,
    "Transtage 11 (Titan IIIC)": 742,
    "ESSA 2 op debris (despin weight)": 743,
    "KH-4A 34 (Corona 110 - OPS 1599)": 744,
    "Atlas SLV-3 Agena D fragmentation debris": 745,
    "PAGEOS 1": 746,
    "Cosmos-122": 747,
    "PAGEOS 1 operational debris (canister half)": 748,
    "Explorer 33": 749,
    "KH-4A 34 operational debris (Fairing)": 750,
    "Delta E operational debris (despin weight)": 751,
    "Saturn IVB (S-IB) (Saturn IB)": 752,
    "Proton 3": 753,
    "Apollo 3 AS-203 Nosecone": 754,
    "Proton 3 operational debris (fairing)": 755,
    "Cosmos-123": 756,
    "Saturn IB fragmentation debris": 757,
    "KH-7 30 (Gambit-1 30 - OPS 1850)": 758,
    "OV1 8 (PasComSat)": 759,
    "Cosmos-124": 760,
    "Atlas D operational debris (Container Half)": 761,
    "Explorer 32 op debris (despin weight)": 762,
    "Atlas D operational debris (control assembly)": 763,
    "Gemini 10 Target": 764,
    "Gemini 10": 765,
    "Blok-I (Soyuz 11A510)": 766,
    "Transit 12 operational debris (despin weight)": 767,
    "Titan II Gemini operational debris (ELSS chest pack)": 768,
    "Gemini 10 operational debris (Equipment Module)": 769,
    "Cosmos-126": 770,
    "KH-8 1 (Gambit-3 1 - OPS 3014)": 771,
    "Titan II Gemini operational debris (umbilical bag)": 772,
    "Titan II Gemini operational debris (Hasselblad camera)": 773,
    "OV3 3": 774,
    "Cosmos-127": 775,
    "KH-4A 35 (Corona 111": 776,
    "Lunar Orbiter 1": 777,
    "KH-7 31 (Gambit-1 31 - OPS 1832)": 778,
    "OPS 6810": 779,
    "Pioneer 7": 780,
    "Transit 14 (NNS O-10)": 781,
    "OPS 0856 (RTS-1 2)": 782,
    "Luna 11": 783,
    "Cosmos-128": 784,
    "Secor 7 (EGRS 7)": 785,
    "ERS 15": 786,
    "Gemini 11 Target": 787,
    "Gemini 11": 788,
    "Gemini 11 op debris (Equipment Module)": 789,
    "DMSP 4A-F7 (OPS 6026)": 790,
    "KH-7 32 (Gambit-1 32 - OPS 1686)": 791,
    "OPS 6874": 792,
    "Star 37B (Thor-Burner II)": 793,
    "Surveyor 2": 794,
    "KH-4A 36 (Corona 112 - OPS 1703)": 795,
    "KH-8 2 (Gambit-3 2 - OPS 4096)": 796,
    "KH-4A 36 operational debris (Fairing)": 797,
    "ESSA 3": 798,
    "Cosmos U-1 (OGCh)": 799,
    "R-36-O-2 (Tsyklon SL-10 (F-1r))": 800,
    "Cosmos U-1 fragmentation debris": 801,
    "Cosmos U-1 operational debris (Adapter)": 802,
    "OPS 1920": 803,
    "Cosmos U-1 operational debris (Retro)": 804,
    "KH-7 33 (Gambit-1 33 - OPS 2055)": 805,
    "Cosmos-129": 806,
    "OPS 5345 operational debris": 807,
    "Molniya 1-4": 808,
    "Cosmos-130": 809,
    "Luna 12": 810,
    "Surveyor Model 3": 811,
    "Intelsat II F-1": 812,
    "OV3 2": 813,
    "ESSA 3 op debris (despin weight)": 814,
    "Secor 8 (EGRS 8)": 815,
    "KH-7 34 (Gambit-1 34 - OPS 2070)": 816,
    "OV4 3 (MOL Canister) + Transtage": 817,
    "OV4 1R": 818,
    "OV1 6": 819,
    "OV4 1T": 820,
    "LES 2 operational debris (AKM)": 821,
    "Lunar Orbiter 2": 822,
    "Cosmos U-2 warhead(OGCh)": 823,
    "KH-4A 37 (Corona 113 - OPS 1866)": 824,
    "Cosmos U-2 op debris (Adapter)": 825,
    "Cosmos U-2 fragmentation debris": 826,
    "Gemini 12 Target": 827,
    "Gemini 12": 828,
    "Cosmos-131": 829,
    "Gemini 12 adaptor module": 830,
    "Cosmos-132": 831,
    "Cosmos-133": 832,
    "Blok-I (Soyuz 11A511)": 833,
    "Cosmos-134": 834,
    "KH-7 35 (Gambit-1 35 - OPS 1890)": 835,
    "ATS 1": 836,
    "OV1 9": 837,
    "OV1 10": 838,
    "Cosmos-135": 839,
    "KH-8 3 (Gambit-3 3 - OPS 8968)": 840,
    "Biosat 1 op debris (Adapter)": 841,
    "Boost motor (OV1 10)": 842,
    "Boost motor (OV1 9)": 843,
    "Delta E (Delta G)": 844,
    "Cosmos-136": 845,
    "Luna 13": 846,
    "Cosmos-137": 847,
    "Molniya-M Block L stage 4 casing": 848,
    "Biosatellite 1": 849,
    "OPS 1584 (Heavy Ferret C 3)": 850,
    "OPS 1584 operational debris": 851,
    "Intelsat II F-2": 852,
    "KH-4B 38 (Corona 114 - OPS 1664)": 853,
    "OPS 9321 (IDSCS 8)": 854,
    "Cosmos-138": 855,
    "OPS 9322 (IDSCS 9)": 856,
    "OPS 9323 (IDSCS 10)": 857,
    "OPS 9324 (IDSCS 11)": 858,
    "OPS 9325 (IDSCS 12)": 859,
    "OPS 9326 (IDSCS 13)": 860,
    "OPS 9327 (IDSCS 14)": 861,
    "OPS 9328 (IDSCS 15)": 862,
    "Cosmos-139": 863,
    "ESSA 4": 864,
    "Tsyklon-2r op debris (platform + Cosmos-139 Adapter)": 865,
    "Transtage 13 (Titan IIIC)": 866,
    "KH-4B 38 operational debris (Fairing)": 867,
    "KH-7 36 (Gambit-1 36 - OPS 4399)": 868,
    "Lunar Orbiter 3": 869,
    "Cosmos-140": 870,
    "DMSP 4A-F8 (OPS 6073)": 871,
    "Cosmos-141": 872,
    "Diademe 1": 873,
    "Cosmos-142": 874,
    "Diademe 2": 875,
    "KH-4B 39 (Corona 115 - OPS 4750)": 876,
    "KH-8 4 (Gambit-3 4 - OPS 4204)": 877,
    "Cosmos-143": 878,
    "Cosmos-144": 879,
    "Cosmos-145": 880,
    "OSO 3": 881,
    "Cosmos-146 (Zond)": 882,
    "Cosmos-135 operational debris": 883,
    "Proton-K/DM-2 ullage motor (SOZ)": 884,
    "Cosmos-147": 885,
    "Cosmos-148": 886,
    "Cosmos-149": 887,
    "Cosmos-150": 888,
    "Intelsat II F-3": 889,
    "Cosmos-151": 890,
    "Cosmos 3 second stage (S3) (Cosmos 3 (11K65))": 891,
    "Cosmos-152": 892,
    "KH-4B 40 (Corona 116 - OPS 4779)": 893,
    "Cosmos-153": 894,
    "ATS 2": 895,
    "Proton-K/D ullage motor (SOZ)": 896,
    "Cosmos-154": 897,
    "Cosmos-155": 898,
    "Transit 15 (NNS O-12)": 899,
    "Surveyor 3": 900,
    "ESSA 5": 901,
    "Soyuz 1": 902,
    "San Marco 2": 903,
    "Cosmos-156": 904,
    "Vela 7": 905,
    "Vela 8": 906,
    "ERS 18": 907,
    "OV5 3 (ERS 20)": 908,
    "OV5 1 (ERS 27)": 909,
    "Transtage 10 (Titan IIIC)": 910,
    "Lunar Orbiter 4": 911,
    "Ariel III": 912,
    "Cosmos-3 (11K65) operational debris": 913,
    "Transit 15 operational debris (despin weight)": 914,
    "KH-4B 41 (Corona 117 - OPS 4696)": 915,
    "Hitch-hiker 14 (OPS 1967)": 916,
    "Cosmos-157": 917,
    "Transit VE-5 fragmentation debris": 918,
    "Cosmos-158": 919,
    "Cosmos 3 second stage (S3) (Cosmos 3M (11K65M))": 920,
    "Cosmos-159": 921,
    "Cosmos-160": 922,
    "Transit 16 (NNS O-13)": 923,
    "Cosmos-161": 924,
    "KH-7 37 (Gambit-1 37)": 925,
    "Proton-K 8S812 (Proton-K/D)": 926,
    "Explorer 34 (IMP 4)": 927,
    "Molniya 1-5": 928,
    "Cosmos-158 debris": 929,
    "KH-4B 41 operational debris (Fairing)": 930,
    "OPS 5712 payload 160 (Calsphere IV)": 931,
    "Cosmos-162": 932,
    "GGSE 4": 933,
    "KH-7 38 (Gambit-1 38 - OPS 4360)": 934,
    "Cosmos-163": 935,
    "GGSE 5": 936,
    "Cosmos-164": 937,
    "Blok-I (Molniya-M Blok-VL)": 938,
    "Venera 4": 939,
    "Cosmos-165": 940,
    "Mariner 5": 941,
    "Timation 1": 942,
    "Cosmos-166": 943,
    "KH-4B 42 (Corona 118 - OPS 3559)": 944,
    "OPS 1873": 945,
    "Cosmos-167": 946,
    "Blok-VL (Molniya-M Blok-VL)": 947,
    "KH-8 6 (Gambit-3 6 - OPS 4282)": 948,
    "Secor 9 (EGRS 9)": 949,
    "OPS 9331 (IDSCS 16)": 950,
    "OPS 9332 (IDSCS 17)": 951,
    "OPS 9333 (IDSCS 18)": 952,
    "OPS 9334 (IDSCS 19, DATS)": 953,
    "LES 5": 954,
    "DODGE 1": 955,
    "Transtage 14 (Titan IIIC)": 956,
    "Cosmos-168": 957,
    "Surcal 159 (Calsphere III)": 958,
    "OPS 5712 payload 152 (NRL PL151)": 959,
    "OPS 5712 payload 153 (NRL PL153)": 960,
    "Surveyor 4": 961,
    "Aurora 1": 962,
    "Star 13A (Thor-Burner II)": 963,
    "Cosmos-169": 964,
    "Tsyklon-2r platform": 965,
    "Tsyklon-2r operational debris": 966,
    "Explorer 35": 967,
    "OPS 1879 (Heavy Ferret C 4)": 968,
    "OPS 1879 operational debris": 969,
    "OV1 86": 970,
    "Boost motor (OV1 86)": 971,
    "OGO 4": 972,
    "Boost motor (OV1 12)": 973,
    "OV1 12": 974,
    "Cosmos-170": 975,
    "Lunar Orbiter 5": 976,
    "Surcal 150B (NRL PL150B)": 977,
    "KH-4A 43  (Corona 119 - OPS 4827)": 978,
    "Cosmos-171 (OGCh)": 979,
    "Kosmos-171 Adapter": 980,
    "Cosmos-172": 981,
    "OV1 86 operational debris": 982,
    "KH-8 7 (Gambit-3 7 - OPS 4886)": 983,
    "DMSP 4A-F9 (OPS 7202)": 984,
    "Cosmos-173": 985,
    "KH-4B 43 operational debris (Fairing)": 986,
    "Molniya-M fourth stage (Block L)": 987,
    "Cosmos-174": 988,
    "Transit 5B-2 operational debris": 989,
    "Cosmos U-2 op debris (OGCh Retro)": 990,
    "Biosatellite 2": 991,
    "Surveyor 5": 992,
    "CENTAUR D/E (Atlas SLV3C)": 993,
    "Cosmos-175": 994,
    "Cosmos-176": 995,
    "KH-4B 1 (Corona 120 - OPS 5089)": 996,
    "Cosmos-177": 997,
    "Cosmos-178": 998,
    "KH-8 8 (Gambit-3 8 - OPS 4941)": 999,
    "Cosmos-176 operational debris": 1000,
    "Cosmos-179": 1001,
    "Transit 17 (NNS O-14)": 1002,
    "Cosmos-180": 1003,
    "Intelsat II F-4": 1004,
    "Molniya 1-6": 1005,
    "DMSP 4A-F10 (OPS 1264)": 1006,
    "Cosmos-181": 1007,
    "Cosmos-182": 1008,
    "OSO 4": 1009,
    "Cosmos-183": 1010,
    "Molniya 1-7": 1011,
    "Cosmos-184": 1012,
    "KH-8 9 (Gambit-3 9 - OPS 4995)": 1013,
    "Cosmos-185": 1014,
    "Cosmos-186": 1015,
    "Cosmos-187": 1016,
    "Tsiklon 2-2 (Tsyklon SL-11 (F-1m))": 1017,
    "Cosmos-188": 1018,
    "Cosmos-189": 1019,
    "KH-4B 44 (Corona 121 - OPS 0562)": 1020,
    "OPS 1587": 1021,
    "Cosmos-190": 1022,
    "Cosmos-189 debris": 1023,
    "ATS 3": 1024,
    "Surveyor 6": 1025,
    "Apollo 4": 1026,
    "Saturn IVB (S-V) (Saturn V)": 1027,
    "ESSA 6": 1028,
    "Cosmos-191": 1029,
    "Cosmos-192": 1030,
    "Cosmos-193": 1031,
    "WRESAT 1": 1032,
    "Cosmos-194": 1033,
    "OV3 6": 1034,
    "KH-8 10 (Gambit-3 10": 1035,
    "KH-4B 2 (Corona 122 - OPS 1001)": 1036,
    "Pioneer 8": 1037,
    "TETR 1 (TTS 1)": 1038,
    "Cosmos-195": 1039,
    "Cosmos-196": 1040,
    "Cosmos-197": 1041,
    "Cosmos-198 (NPP)": 1042,
    "Cosmos-198 (PELPS (propulsion system))": 1043,
    "Cosmos-198 (SLR radar antenna)": 1044,
    "Surveyor 7": 1045,
    "Explorer 36 (Geos 2)": 1046,
    "OPS 1965 (Heavy Ferret C 5)": 1047,
    "KH-8 11 (Gambit-3 11": 1048,
    "Cosmos-199 equipment bay (Priborniy otsek)": 1049,
    "Cosmos-200": 1050,
    "OPS 1965 operational debris": 1051,
    "Cosmos-200 debris": 1052,
    "Apollo 5 (LM 1 Ascent Stage)": 1053,
    "Apollo 5 (LM 1 Descent Stage)": 1054,
    "KH-4B 45 (Corona 123 - OPS 2243)": 1055,
    "OPS 6236": 1056,
    "Cosmos-199": 1057,
    "Cosmos-201": 1058,
    "KH-4B 45 operational debris (Fairing)": 1059,
    "Midas-7 debris": 1060,
    "Explorer 36 operational debris (despin weight)": 1061,
    "Cosmos-202": 1062,
    "Cosmos-203": 1063,
    "Transit 18 (NNS O-18)": 1064,
    "Zond 4": 1065,
    "Proton-K/D fourth stage casing": 1066,
    "OGO 5": 1067,
    "Cosmos-204": 1068,
    "Cosmos-205": 1069,
    "Explorer 37 (SR 9)": 1070,
    "Proton-K/D operational debris (SOK)": 1071,
    "Agena D (Atlas SLV3A)": 1072,
    "Cosmos-203 debris": 1073,
    "KH-8 12 (Gambit-3 12": 1074,
    "Cosmos-206": 1075,
    "KH-4B 46 (Corona 124 - OPS 4849)": 1076,
    "OPS 7076": 1077,
    "Cosmos-207": 1078,
    "Cosmos-208": 1079,
    "Cosmos-209 (NPP)": 1080,
    "Tsyklon-2 operational debris": 1081,
    "Tsyklon-2 platform": 1082,
    "Cosmos-208 instrument package": 1083,
    "Cosmos-210": 1084,
    "Apollo 6": 1085,
    "Cosmos-210 operational debris": 1086,
    "OV1 13": 1087,
    "OV1 14": 1088,
    "Boost motor (OV1 14)": 1089,
    "Luna 14": 1090,
    "Cosmos-211": 1091,
    "Cosmos-212": 1092,
    "Saturn V fragmentation debris": 1093,
    "Cosmos-213": 1094,
    "KH-8 13 (Gambit-3 13 - OPS 5105)": 1095,
    "Cosmos-214": 1096,
    "Cosmos-215": 1097,
    "Cosmos-216": 1098,
    "Molniya 1-8": 1099,
    "Blok-I (Molniya-M Blok-ML)": 1100,
    "Boost motor (OV1 13)": 1101,
    "Cosmos-217": 1102,
    "Cosmos-218": 1103,
    "Cosmos-219": 1104,
    "LTTAT Agena D stage 2 (Agena D) Fairing": 1105,
    "Cosmos-220": 1106,
    "Cosmos-220 debris": 1107,
    "KH-4B 3 (Corona 125)(OPS 1419)": 1108,
    "Iris (ESRO 2)": 1109,
    "DMSP 5A-F1 (OPS 7869)": 1110,
    "Cosmos-221": 1111,
    "Cosmos-222": 1112,
    "Cosmos-223": 1113,
    "Cosmos-224": 1114,
    "KH-8 14 (Gambit-3 14 - OPS 5138)": 1115,
    "Cosmos-225": 1116,
    "Cosmos-226": 1117,
    "OPS 9341 (IDSCS 20)": 1118,
    "OPS 9342 (IDSCS 21)": 1119,
    "OPS 9343 (IDSCS 22)": 1120,
    "OPS 9344 (IDSCS 23)": 1121,
    "OPS 9345 (IDSCS 24)": 1122,
    "OPS 9346 (IDSCS 25)": 1123,
    "OPS 9347 (IDSCS 26)": 1124,
    "OPS 9348 (IDSCS 27)": 1125,
    "Transtage 16 (Titan IIIC)": 1126,
    "Cosmos-227": 1127,
    "KH-4B 47 (Corona 126 - OPS 5343)": 1128,
    "OPS 5259": 1129,
    "Cosmos-228": 1130,
    "Cosmos-229": 1131,
    "Cosmos-228 instrument package": 1132,
    "Explorer 38 (RAE 1)": 1133,
    "Cosmos-230": 1134,
    "Molniya 1-9": 1135,
    "Star 37D (Delta J)": 1136,
    "Cosmos-231": 1137,
    "OV1 15": 1138,
    "LOADS (OV1 16)": 1139,
    "Boost motor (OV1 15)": 1140,
    "Boost motor (OV1 16)": 1141,
    "Cosmos-232": 1142,
    "Cosmos-233": 1143,
    "Cosmos-234": 1144,
    "OPS 2222 (CANYON 1)": 1145,
    "KH-8 (03335)": 1146,
    "KH-4B (03336)": 1147,
    "Explorer 39": 1148,
    "Explorer 40": 1149,
    "Cosmos-235": 1150,
    "ATS 4": 1151,
    "ESSA 7": 1152,
    "Delta E (Delta N)": 1153,
    "Cosmos-236": 1154,
    "Cosmos-237": 1155,
    "Cosmos-238": 1156,
    "Cosmos-239": 1157,
    "KH-8 (03375)": 1158,
    "Cosmos-240": 1159,
    "Zond 5": 1160,
    "Proton-K/D operational debris": 1161,
    "Cosmos-241": 1162,
    "KH-4B (03408)": 1163,
    "OPS 8595": 1164,
    "Cosmos-242": 1165,
    "Delta N operational debris": 1166,
    "Cosmos-243": 1167,
    "OV2-5 (DG7-2)": 1168,
    "ERS 28 (OV5-4)": 1169,
    "ERS 21 (OV5-2)": 1170,
    "LES 6": 1171,
    "Transtage 5 (Titan IIIC)": 1172,
    "Cosmos-244": 1173,
    "Cosmos-243 instrument package": 1174,
    "Cosmos-245": 1175,
    "Aurorae (ESRO 1A)": 1176,
    "Molniya 1-10": 1177,
    "OPS 0964": 1178,
    "Cosmos-246": 1179,
    "ESRO 1A despin weight": 1180,
    "Cosmos-247": 1181,
    "Apollo 7": 1182,
    "Cosmos-248": 1183,
    "Cosmos-249": 1184,
    "Cosmos-249 fragmentation debris": 1185,
    "DMSP 5A-F2": 1186,
    "Soyuz 2": 1187,
    "Blok-ML (Molniya-M Blok-ML)": 1188,
    "Soyuz 3": 1189,
    "Cosmos-250": 1190,
    "Cosmos-251": 1191,
    "Cosmos-252": 1192,
    "KH-4B (03531)": 1193,
    "KH-8 (03532)": 1194,
    "Pioneer 9": 1195,
    "TETR 2": 1196,
    "Zond 6": 1197,
    "Cosmos-251 operational debris": 1198,
    "Cosmos-253": 1199,
    "Proton-4": 1200,
    "Proton-K 8S812": 1201,
    "Cosmos-252 fragmentation debris": 1202,
    "Cosmos-254": 1203,
    "Cosmos-248 fragmentation debris": 1204,
    "Cosmos-255": 1205,
    "Cosmos-256": 1206,
    "Cosmos-257": 1207,
    "Transit 12 fragmentation debris (insulation)": 1208,
    "KH-8 (03594)": 1209,
    "HEOS 1": 1210,
    "OAO 2": 1211,
    "Cosmos-258": 1212,
    "KH-4B (03604)": 1213,
    "OPS 7684": 1214,
    "OV1 5 operational debris": 1215,
    "Cosmos-259": 1216,
    "ESSA 8": 1217,
    "OPS 7684 operational debris": 1218,
    "Cosmos-260": 1219,
    "Intelsat III F-2": 1220,
    "Cosmos-261": 1221,
    "Apollo 8": 1222,
    "Cosmos-262": 1223,
    "Venera 5": 1224,
    "Venera 6": 1225,
    "Cosmos-263": 1226,
    "Soyuz 4": 1227,
    "Soyuz 5": 1228,
    "Soyuz 11A511 operational debris": 1229,
    "Cosmos-250 debris": 1230,
    "OSO 5": 1231,
    "KH-8 (03665)": 1232,
    "KH-8 (03665) operational debris": 1233,
    "Cosmos-264": 1234,
    "ISIS 1": 1235,
    "KH-4B (03672)": 1236,
    "OPS 2644": 1237,
    "Intelsat III F-3": 1238,
    "Cosmos-265": 1239,
    "TACSAT 1": 1240,
    "Transtage 17 (Titan IIIC)": 1241,
    "Explorer 11 operational debris": 1242,
    "Diademe 1 operational debris": 1243,
    "Explorer 23 operational debris": 1244,
    "Mariner 6": 1245,
    "Cosmos-266": 1246,
    "ESSA 9": 1247,
    "Cosmos-267": 1248,
    "Apollo 9": 1249,
    "Apollo 9 LM (APS)": 1250,
    "KH-8 (03772)": 1251,
    "Cosmos-268": 1252,
    "Cosmos-269": 1253,
    "Cosmos-270": 1254,
    "Cosmos 3 debris": 1255,
    "Apollo 9 LM (DPS)": 1256,
    "Cosmos-271": 1257,
    "Cosmos-272": 1258,
    "OV1 17": 1259,
    "OV1 18": 1260,
    "OV1 19": 1261,
    "OV1 17A": 1262,
    "Boost motor (OV1 19)": 1263,
    "Boost motor (OV1 18)": 1264,
    "KH-4B (03829)": 1265,
    "OPS 2285": 1266,
    "Cosmos-273": 1267,
    "Cosmos-274": 1268,
    "Meteor 1-1": 1269,
    "Mariner 7": 1270,
    "OPS 2644 operational debris": 1271,
    "Cosmos-275": 1272,
    "Explorer38 op deb(Star 17 apogee motor)": 1273,
    "Vostok fragmentation debris": 1274,
    "Cosmos-276": 1275,
    "Cosmos-277": 1276,
    "Cosmos-278": 1277,
    "Molniya 1-11": 1278,
    "OPS 3148 (CANYON 2)": 1279,
    "Nimbus 3 (NPP)": 1280,
    "Secor 13": 1281,
    "Agena D (Thorad-Agena D)": 1282,
    "Cosmos-279": 1283,
    "KH-8 (03895)": 1284,
    "Cosmos-280": 1285,
    "KH-4B (03914)": 1286,
    "OPS 1721": 1287,
    "Cosmos-280 operational debris": 1288,
    "Cosmos-281": 1289,
    "Apollo 10 CM (Charlie Brown)": 1290,
    "KH-4B (03914) operational debris": 1291,
    "Cosmos-282": 1292,
    "Intelsat III F-4": 1293,
    "Apollo 10 LM (DPS)": 1294,
    "Apollo 10 LM (APS) (Snoopy)": 1295,
    "OV5 (ERS 29)": 1296,
    "OV6 (ERS 26)": 1297,
    "OV5 9": 1298,
    "Vela 9": 1299,
    "Vela 10": 1300,
    "Transtage 15 (Titan IIIC)": 1301,
    "Cosmos-283": 1302,
    "Cosmos-284": 1303,
    "Cosmos-285": 1304,
    "KH-8 (03984)": 1305,
    "OGO 6": 1306,
    "Cosmos-286": 1307,
    "Explorer 41": 1308,
    "Cosmos-287": 1309,
    "Cosmos-288": 1310,
    "Titan IIIC debris (Transtage 8)": 1311,
    "Biosatellite 3": 1312,
    "Cosmos-289": 1313,
    "Luna-15 KT": 1314,
    "Apollo 11 CM (Columbia)": 1315,
    "Apollo 11 LM Eagle (APS)": 1316,
    "Cosmos-290": 1317,
    "Molniya 1-12": 1318,
    "DMSP 5A-F3": 1319,
    "KH-4B (04050)": 1320,
    "Intelsat III F-5": 1321,
    "Delta M fragmentation debris": 1322,
    "Star 37D (Delta M)": 1323,
    "OPS 8285": 1324,
    "Cosmos-291": 1325,
    "Zond 7": 1326,
    "OSO 6": 1327,
    "PAC 1": 1328,
    "ATS 5": 1329,
    "Cosmos-292": 1330,
    "Cosmos-293": 1331,
    "Cosmos-294": 1332,
    "Cosmos-295": 1333,
    "KH-8 (04078)": 1334,
    "Cosmos-296": 1335,
    "Cosmos-297": 1336,
    "Cosmos-292 debris": 1337,
    "Cosmos-298": 1338,
    "Cosmos-299": 1339,
    "KH-4B (04102)": 1340,
    "OPS 4710": 1341,
    "Cosmos-300": 1342,
    "Cosmos-301": 1343,
    "WESTON (OPS 1807)": 1344,
    "Agena D debris": 1345,
    "WESTON operational debris (antenna cover)": 1346,
    "Boreas (ESRO 1B)": 1347,
    "ESRO 1B despin weight": 1348,
    "Meteor 1-2": 1349,
    "OV1 18 operational debris": 1350,
    "Soyuz 6": 1351,
    "Soyuz 7": 1352,
    "Soyuz 8": 1353,
    "Intercosmos 1": 1354,
    "Cosmos-302": 1355,
    "SOICAL cone": 1356,
    "Cosmos-303": 1357,
    "Cosmos-304": 1358,
    "SOICAL cylinder": 1359,
    "Tempsat 2": 1360,
    "Cosmos-306": 1361,
    "Cosmos-307": 1362,
    "KH-8 (04186)": 1363,
    "Cosmos-308": 1364,
    "Azur": 1365,
    "Cosmos-309": 1366,
    "Apollo 12": 1367,
    "Cosmos-310": 1368,
    "Cosmos-309 operational debris": 1369,
    "Cosmos-309 Capsule": 1370,
    "OPS 7613 payload 4": 1371,
    "Apollo 12 LM (APS)": 1372,
    "OPS 7613 payload 5": 1373,
    "Skynet 1A": 1374,
    "Cosmos-311": 1375,
    "Cosmos-312": 1376,
    "Timation 2": 1377,
    "OPS 7613 payload 3": 1378,
    "Cosmos-313": 1379,
    "KH-4B (04264)": 1380,
    "Cosmos-314": 1381,
    "Cosmos-315": 1382,
    "Cosmos-315 debris": 1383,
    "Cosmos-317": 1384,
    "Cosmos-316": 1385,
    "Cosmos-316 operational debris": 1386,
    "Intercosmos 2": 1387,
    "Cosmos-317 engine": 1388,
    "Cosmos-317 operational debris": 1389,
    "Cosmos-318": 1390,
    "OPS 7613 payload 6": 1391,
    "KH-8 (04296)": 1392,
    "Intelsat III F-6": 1393,
    "Cosmos-319": 1394,
    "Cosmos-320": 1395,
    "Cosmos-321": 1396,
    "Cosmos-322": 1397,
    "ITOS 1": 1398,
    "OSCAR 5": 1399,
    "Delta E (Delta N6)": 1400,
    "SERT 2": 1401,
    "Cosmos-323": 1402,
    "Ohsumi": 1403,
    "DMSP 5A-F4": 1404,
    "Molniya 1-13": 1405,
    "Cosmos-324": 1406,
    "Cosmos-325": 1407,
    "KH-4B (04342)": 1408,
    "OPS 3402": 1409,
    "DIAL - WIKA": 1410,
    "EUROPA II PERIGEE SYSTEM (Diamant B)": 1411,
    "Cosmos-326": 1412,
    "Meteor 1-3": 1413,
    "Cosmos-327": 1414,
    "NATO I": 1415,
    "Cosmos-328": 1416,
    "Cosmos-329": 1417,
    "Cosmos-330": 1418,
    "Nimbus 4": 1419,
    "TOPO 1": 1420,
    "Cosmos-331": 1421,
    "Vela 12": 1422,
    "Vela 11": 1423,
    "Cosmos-332": 1424,
    "Apollo 13": 1425,
    "Cosmos-333": 1426,
    "KH-8 (04375)": 1427,
    "Intelsat III F-7": 1428,
    "Cosmos-334": 1429,
    "Cosmos-335": 1430,
    "Dong Fang Hong 1": 1431,
    "Cosmos-336": 1432,
    "Cosmos-337": 1433,
    "Cosmos-338": 1434,
    "Cosmos-339": 1435,
    "Cosmos-340": 1436,
    "Cosmos-341": 1437,
    "Cosmos-342": 1438,
    "Cosmos-343": 1439,
    "CZ-1 third stage (Long March (CZ) 1)": 1440,
    "Meteor 1-4": 1441,
    "Cosmos-333 engine": 1442,
    "Cosmos-333 operational debris": 1443,
    "Cosmos-334 operational debris": 1444,
    "CZ-1 operational debris": 1445,
    "Cosmos-344": 1446,
    "Cosmos-345": 1447,
    "KH-4B (04405)": 1448,
    "OPS 8520": 1449,
    "Soyuz 9": 1450,
    "Cosmos-346": 1451,
    "Cosmos-347": 1452,
    "Cosmos-348": 1453,
    "Cosmos-349": 1454,
    "OPS 5346 (Rhyolite 1)": 1455,
    "Meteor 1-5": 1456,
    "KH-8 (04422)": 1457,
    "Cosmos-350": 1458,
    "Cosmos-351": 1459,
    "Molniya 1-14": 1460,
    "Cosmos-352": 1461,
    "Cosmos-353": 1462,
    "KH-4B (04477)": 1463,
    "Intelsat III F-8": 1464,
    "Cosmos-354": 1465,
    "Intercosmos 3": 1466,
    "Cosmos-355": 1467,
    "Cosmos-356": 1468,
    "Venera 7": 1469,
    "Blok-I (Molniya-M Blok-MVL)": 1470,
    "KH-8 (04492)": 1471,
    "Skynet 1B": 1472,
    "Cosmos-357": 1473,
    "Cosmos-358": 1474,
    "Cosmos-359": 1475,
    "OPS 8329": 1476,
    "Transit 19 (NNS 19)": 1477,
    "Cosmos-360": 1478,
    "OPS 7329 (CANYON 3)": 1479,
    "DMSP 5A-F5": 1480,
    "Cosmos-358 debris": 1481,
    "Cosmos-360 engine": 1482,
    "Cosmos-360 operational debris": 1483,
    "Cosmos-361": 1484,
    "Luna-16 KT": 1485,
    "Cosmos-362": 1486,
    "Cosmos-363": 1487,
    "Cosmos-361 engine": 1488,
    "Cosmos-361 operational debris": 1489,
    "Cosmos-364": 1490,
    "Cosmos-365": 1491,
    "Cosmos-366": 1492,
    "Cosmos-364 engine": 1493,
    "Cosmos-367 (NPP) (reactor section)": 1494,
    "Cosmos-367 debris": 1495,
    "Cosmos-367 propulsion unit (DU)": 1496,
    "Cosmos-367 SAR antenna (RLS)": 1497,
    "Molniya 1-15": 1498,
    "Cosmos-368": 1499,
    "Cosmos-369": 1500,
    "Cosmos-368 operational debris": 1501,
    "Cosmos-370": 1502,
    "Cosmos-371": 1503,
    "Intercosmos 4": 1504,
    "Meteor 1-6": 1505,
    "Cosmos-368 Capsule": 1506,
    "Cosmos-372": 1507,
    "Cosmos-373": 1508,
    "Zond 8": 1509,
    "Cosmos-370 engine": 1510,
    "Cosmos-374": 1511,
    "KH-8 (04596)": 1512,
    "Cosmos-374 fragmentation debris": 1513,
    "Cosmos-375": 1514,
    "Cosmos-376": 1515,
    "Cosmos-375 fragmentation debris": 1516,
    "OPS 5960 (DSP F1)": 1517,
    "Titan 3A-2 (Titan IIIC)": 1518,
    "Transtage 19 (Titan IIIC)": 1519,
    "OFO 1": 1520,
    "Luna 17": 1521,
    "RMS": 1522,
    "OFO 1 operational debris": 1523,
    "Cosmos-377": 1524,
    "Cosmos-376 engine": 1525,
    "Cosmos-378": 1526,
    "KH-4B (04721)": 1527,
    "OPS 6829": 1528,
    "Cosmos-379 (Lunar Ship T2K)": 1529,
    "Blok-I (Soyuz 11A511L)": 1530,
    "Cosmos-380": 1531,
    "Molniya 1-16": 1532,
    "Cosmos-379 operational debris (T2K lower section)": 1533,
    "Cosmos-381": 1534,
    "Cosmos-382": 1535,
    "Cosmos-383": 1536,
    "Cosmos-384": 1537,
    "NOAA 1": 1538,
    "Cosmos-384 operational debris (sensor cover)": 1539,
    "Explorer 42": 1540,
    "Cosmos-385": 1541,
    "Peole 1": 1542,
    "Diamant B operational debris": 1543,
    "Cosmos-386": 1544,
    "Cosmos-387": 1545,
    "Cosmos-387 debris": 1546,
    "Cosmos-384 Capsule": 1547,
    "Cosmos-388": 1548,
    "Cosmos-389": 1549,
    "Cosmos-379 operational debris (T2K MRO)": 1550,
    "Molniya 1-17": 1551,
    "Cosmos-386 operational debris": 1552,
    "Cosmos-386 engine": 1553,
    "Cosmos-381 debris": 1554,
    "Delta J operational debris": 1555,
    "Transit 15 operational debris": 1556,
    "Cosmos-390": 1557,
    "Cosmos-391": 1558,
    "Meteor 1-7": 1559,
    "Cosmos-392": 1560,
    "KH-8 (04874)": 1561,
    "KH-8 (04874) operational debris": 1562,
    "Cosmos-390 engine": 1563,
    "Cosmos-390 operational debris": 1564,
    "Intelsat IV F-2": 1565,
    "Cosmos-393": 1566,
    "Apollo 14": 1567,
    "Intelsat II F-2 operational debris": 1568,
    "NATO IIB": 1569,
    "Apollo 14 LM (APS)": 1570,
    "Cosmos-394": 1571,
    "ALTAIR 1 (Delta A)": 1572,
    "Cosmos-394 debris": 1573,
    "Tansei": 1574,
    "DMSP 5A-F6": 1575,
    "Cosmos-395": 1576,
    "Calsphere 3": 1577,
    "Cosmos-396": 1578,
    "Cosmos-396 operational debris": 1579,
    "Calsphere 5": 1580,
    "Cosmos-397": 1581,
    "Cosmos-398 (Lunar Ship T2K)": 1582,
    "Cosmos-395 debris": 1583,
    "Cosmos-399": 1584,
    "Cosmos-396 engine": 1585,
    "Shi Jian 1": 1586,
    "Cosmos-398 operational debris (T2K lower section)": 1587,
    "Cosmos-397 fragmentation debris": 1588,
    "Cosmos-398 operational debris (T2K MRO)": 1589,
    "Explorer 43": 1590,
    "Delta E (Delta M6)": 1591,
    "Star 37D (Delta M6)": 1592,
    "Delta M-6 operational debris": 1593,
    "Cosmos-399 engine": 1594,
    "Cosmos-399 operational debris": 1595,
    "Cosmos-400": 1596,
    "Jumpseat 1": 1597,
    "Agena D (Titan IIIB)": 1598,
    "Meteor 1-4 operational debris": 1599,
    "KH-4B (05059)": 1600,
    "Cosmos-401": 1601,
    "ISIS 2": 1602,
    "Cosmos-402 (NPP) (reactor section)": 1603,
    "Cosmos-402 propulsion unit (DU)": 1604,
    "Cosmos-403": 1605,
    "Cosmos-402 debris": 1606,
    "Cosmos-402 SAR antenna (RLS)": 1607,
    "Cosmos-404": 1608,
    "Cosmos-404 operational debris(sensor cover)": 1609,
    "Cosmos-405": 1610,
    "Cosmos-401 engine": 1611,
