{
  "relation2id": {
    "<PAD>": 0,
    "operator": 1,
    "state": 2,
    "launch": 3,
    "host_country": 4,
    "launch_system": 5,
    "launch_site": 6,
    "fragmentation": 7,
    "entity": 8,
    "launch_vehicle": 9,
    "launch_vehicle_engine": 10,
    "launch_vehicle_family": 11,
    "launch_vehicle_stage": 12,
    "propellant": 13
  },
  "concept2id": {
    "<PAD>": 0,
    "Object": 1,
    "RocketBodyObjClass": 2,
    "Entity": 3,
    "Organisation": 4,
    "Country": 5,
    "PayloadObjClass": 6,
    "PayloadMissionRelatedObjectObjClass": 7,
    "RocketMissionRelatedObjectObjClass": 8,
    "RocketFragmentationDebrisObjClass": 9,
    "PayloadFragmentationDebrisObjClass": 10,
    "PayloadDebrisObjClass": 11,
    "RocketDebrisObjClass": 12,
    "UnknownObjClass": 13,
    "OtherDebrisObjClass": 14,
    "OtherMissionRelatedObjectObjClass": 15,
    "Fragmentation": 16,
    "Launch": 17,
    "LaunchVehicle": 18,
    "LaunchVehicleFamily": 19,
    "LaunchVehicleStage": 20,
    "LaunchSystem": 21
  },
  "function2id": {
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "FindAll": 3,
    "FilterStr": 4,
    "FilterConcept": 5,
    "And": 6,
    "What": 7,
    "Find": 8,
    "QueryAttrQualifier": 9,
    "Relate": 10,
    "QueryAttr": 11,
    "VerifyStr": 12,
    "FilterNum": 13,
    "SelectBetween": 14,
    "QueryRelationQualifier": 15,
    "QueryRelation": 16,
    "Count": 17,
    "VerifyNum": 18,
    "VerifyYear": 19,
    "FilterYear": 20,
    "SelectAmong": 21,
    "FilterDate": 22,
    "QueryAttrUnderCondition": 23,
    "QFilterYear": 24,
    "QFilterStr": 25,
    "Or": 26,
    "QFilterNum": 27,
    "QFilterDate": 28,
    "VerifyDate": 29
  },
  "operator2id": {
    "<PAD>": 0,
    "=": 1,
    "<": 2,
    "!=": 3,
    ">": 4
  },
  "entity2id": {
    "<PAD>": 0,
    "Sputnik (8K71PS) Blok-A": 1,
    "Strategic Rocket Forces": 2,
    "USSR, Union of Soviet Socialist Republics": 3,
    "Sputnik 1": 4,
    "OKB-1 im. S.P. Korolev": 5,
    "Sputnik 2": 6,
    "Explorer 1": 7,
    "U.S. Army Ballistic Missile Agency": 8,
    "Jet Propulsion Lab": 9,
    "United States": 10,
    "Vanguard 1": 11,
    "Naval Research Lab": 12,
    "Explorer 3": 13,
    "Sputnik (8A91) Blok-A": 14,
    "Sputnik 3": 15,
    "Explorer 4": 16,
    "Score": 17,
    "US Army Signal Corps RD Labs": 18,
    "Vanguard 2": 19,
    "NASA Beltsville Space Center": 20,
    "Grand Central (ALB) (Vanguard)": 21,
    "Discoverer 1": 22,
    "Advanced Research Projects Agency, U.S. DoD": 23,
    "Central Intelligence Agency, USA": 24,
    "Discoverer 2": 25,
    "Explorer 6": 26,
    "NASA Goddard Space Flight Center": 27,
    "Altair 1 (Thor-Able)": 28,
    "United States Air Force": 29,
    "Discoverer 5": 30,
    "Discoverer 6": 31,
    "Vanguard 3": 32,
    "Luna 3": 33,
    "Explorer 7": 34,
    "SERGEANT_1 (Juno II)": 35,
    "Discoverer 7": 36,
    "Discoverer 8": 37,
    "Discoverer 5 Satellite Return Vehicle": 38,
    "Pioneer 5": 39,
    "National Aeronautics and Space Administration": 40,
    "Tiros I": 41,
    "Able-Star (Thor-Ablestar)": 42,
    "Transit 1B": 43,
    "United States Navy": 44,
    "Discoverer 11": 45,
    "US Air Force Ballistic Missile Division": 46,
    "Thor Ablestar operational debris": 47,
    "Korabl-Sputnik 1 (Sputnik 4) propulsion module": 48,
    "Vostok 8A92M-2 (Vostok SL-3 (A-1))": 49,
    "Korabl-Sputnik 1 (Sputnik 4) cabin": 50,
    "Sputnik 4 operational debris": 51,
    "Midas 2": 52,
    "Atlas LV-3A Agena A nose-cap": 53,
    "Transit 2A": 54,
    "Greb": 55,
    "Discoverer 13": 56,
    "Echo I": 57,
    "NASA Langley Research Center": 58,
    "ALTAIR 1 (Delta)": 59,
    "Echo I metal object": 60,
    "Echo I mylar object": 61,
    "Discoverer 14": 62,
    "Sputnik 5": 63,
    "Discoverer 15": 64,
    "Courier 1B": 65,
    "United States Army": 66,
    "Explorer 8": 67,
    "Discoverer 17": 68,
    "NASA Marshall Space Flight Center": 69,
    "Tiros II": 70,
    "Sputnik 6": 71,
    "Discoverer 18": 72,
    "Discoverer 19": 73,
    "Juno II operational debris": 74,
    "Samos-2 F-1": 75,
    "Sputnik 7": 76,
    "Blok-I (Molniya)": 77,
    "Molniya operational debris (jettisonable engine section (BOZ))": 78,
    "Delta operational debris": 79,
    "Molniya operational debris": 80,
    "Venera 1": 81,
    "Explorer 9": 82,
    "Altair 1A (Scout X-1)": 83,
    "Discoverer 20": 84,
    "Army Map Service, US Army Corps of Engineers": 85,
    "Discoverer 21": 86,
    "Scout X-1 operational debris": 87,
    "Transit 3B - Lofti 1": 88,
    "Discoverer 20 operational debris": 89,
    "Sputnik 9": 90,
    "Sputnik 9 operational debris": 91,
    "Sputnik 10": 92,
    "Vostok operational debris": 93,
    "Explorer 10": 94,
    "Discoverer 23": 95,
    "US Air Force Space Systems Division": 96,
    "Thor Able (3 stage) operational debris (yo-yo weight)": 97,
    "Discoverer 23 Satellite Return Vehicle": 98,
    "Vostok 1": 99,
    "Discoverer 23 operational debris": 100,
    "Explorer 11": 101,
    "Discoverer 25": 102,
    "Discoverer 25 operational debris": 103,
    "Pioneer 1": 104,
    "Pioneer 3": 105,
    "Luna 1": 106,
    "Pioneer 4": 107,
    "Luna 2": 108,
    "Transit 4A (NPP)": 109,
    "Injun 1 - Solrad 3": 110,
    "Thor Ablestar fragmentation debris": 111,
    "Discoverer 26": 112,
    "Tiros III": 113,
    "Midas 3": 114,
    "Atlas LV-3A Agena B nose-cap": 115,
    "Delta operational debris (yo-yo weight)": 116,
    "Vostok 2": 117,
    "Explorer 12": 118,
    "Ranger 1": 119,
    "Agena B (Atlas LV-3A Agena B)": 120,
    "Explorer 13": 121,
    "Discoverer 29": 122,
    "National Reconnaissance Office": 123,
    "Discoverer 30": 124,
    "Mercury Atlas 4": 125,
    "NASA Langley Research Center, Space Task Group": 126,
    "ATLASD (Atlas D)": 127,
    "Discoverer 30 operational debris": 128,
    "Discoverer 31": 129,
    "Midas 3 operational debris (solar array cover)": 130,
    "Discoverer 32": 131,
    "Discoverer 32 operational debris": 132,
    "Midas 4": 133,
    "Midas 4 operational debris (West Ford dispenser)": 134,
    "Midas 4 operational debris (West Ford package fragment)": 135,
    "Discoverer 34": 136,
    "Discoverer 34 operational debris": 137,
    "Discoverer 35": 138,
    "Transit 4B (NPP)": 139,
    "TRAAC": 140,
    "Ranger 2": 141,
    "Discoverer 35 operational debris": 142,
    "Mercury Atlas 5": 143,
    "NASA Manned Spacecraft Center": 144,
    "Discoverer 36": 145,
    "OSCAR 1": 146,
    "Project OSCAR Inc.": 147,
    "Discoverer 36 operational debris (inst. cover)": 148,
    "Samos 5 Reflector": 149,
    "US Air Force Sec. AF, Office of Satellite and Missile Systems": 150,
    "Samos 5 (includes RV)": 151,
    "Ranger 3": 152,
    "Tiros IV": 153,
    "Mercury Atlas 6": 154,
    "NNN (00242)": 155,
    "Discoverer 38": 156,
    "Discoverer 38 operational debris": 157,
    "OSO 1": 158,
    "Samos 6 (includes RV)": 159,
    "Samos-6 reflector": 160,
    "Cosmos-1": 161,
    "Yangel KB": 162,
    "COSMOS A-2 (Cosmos 2I (63S1))": 163,
    "Cosmos-2": 164,
    "Midas 5": 165,
    "Midas 5 operational debris": 166,
    "NNN (00276)": 167,
    "NNN (00276) operational debris": 168,
    "Ranger 4": 169,
    "Cosmos-3": 170,
    "Ariel I": 171,
    "British National Committee for Space Research, Royal Society": 172,
    "United Kingdom": 173,
    "Samos-7": 174,
    "Cosmos-4": 175,
    "NNN (00290)": 176,
    "NNN (00290) operational debris": 177,
    "NNN (00292)": 178,
    "NNN (00292) operational debris": 179,
    "Mercury Atlas 7": 180,
    "Cosmos-5": 181,
    "NNN (00302)": 182,
    "NNN (00302) operational debris": 183,
    "NNN (00304)": 184,
    "OSCAR 2": 185,
    "NNN (00304) operational debris": 186,
    "Samos-8": 187,
    "NNN (00308)": 188,
    "Tiros V": 189,
    "NNN (00308) operational debris": 190,
    "NNN (00315)": 191,
    "NNN (00316)": 192,
    "Cosmos-6": 193,
    "Proto-Vozdhusnoy Oborony": 194,
    "Telstar 1": 195,
    "American Telephone and Telegraph Co.": 196,
    "Samos-9": 197,
    "NNN (00344)": 198,
    "NNN (00345)": 199,
    "Cosmos-7": 200,
    "NNN (00360)": 201,
    "Samos-10": 202,
    "NNN (00360) operational debris": 203,
    "Vostok 3": 204,
    "Vostok 4": 205,
    "Cosmos-8": 206,
    "P-35B": 207,
    "Scout X-2M operational debris": 208,
    "Sputnik 19": 209,
    "Mariner 2": 210,
    "NNN (00377)": 211,
    "Sputnik 20": 212,
    "NNN (00385)": 213,
    "Altair 1A (Scout X-2)": 214,
    "Sputnik 21": 215,
    "NNN (00396) (ERS 2)": 216,
    "Tiros VI": 217,
    "Delta operational debris (yo-yo weight) yo": 218,
    "Cosmos-9": 219,
    "Alouette 1": 220,
    "Defense Research Telecommunications Establishment, Canada": 221,
    "Canada": 222,
    "Agena B (Thor-Agena B)": 223,
    "NNN (00427)": 224,
    "Explorer 14": 225,
    "Mercury Atlas 8": 226,
    "NNN (00436)": 227,
    "Cosmos-10": 228,
    "Ranger 5": 229,
    "Cosmos-11": 230,
    "Sputnik 22": 231,
    "Starad": 232,
    "Explorer 15": 233,
    "ANNA 1B": 234,
    "Mars 1": 235,
    "Sputnik 24": 236,
    "NNN (00453)": 237,
    "Samos-11": 238,
    "Sputnik 22 fragmentation debris": 239,
    "NNN (00481)": 240,
    "NNN (00490)": 241,
    "NNN (00502)": 242,
    "Relay 1": 243,
    "Injun 3": 244,
    "NNN (00505)": 245,
    "Explorer 16": 246,
    "Surcal 1": 247,
    "Surcal 1A": 248,
    "Transit 5A": 249,
    "Thor Agena B operational debris": 250,
    "Calsphere 1A": 251,
    "Scout X-3 operational debris (yo-yo weight)": 252,
    "Altair 1 (Delta B)": 253,
    "Cosmos-12": 254,
    "Altair 1A (Scout X-3)": 255,
    "Agena B (Thor-Agena D)": 256,
    "E-6 No. 2 (failed Luna-4)": 257,
    "KH-4 18 (Corona 59 - OPS 0048)": 258,
    "NNN (00525) operational debris": 259,
    "Samos-F2 3 (OPS 0180)": 260,
    "NNN (00527) operational debris": 261,
    "DSAP-1 F3 (P-35C - OPS 0240 - FTV 0240)": 262,
    "Scout X-3M operational debris": 263,
    "Syncom 1": 264,
    "Cosmos-13": 265,
    "KH-4 20 (Corona 62 - OPS 0720)": 266,
    "Explorer 17": 267,
    "Luna 4": 268,
    "Cosmos-14": 269,
    "All-Union Electromechanical Scientific Research Institute": 270,
    "Cosmos-15": 271,
    "Cosmos-16": 272,
    "Telstar 2": 273,
    "Midas 6": 274,
    "Mercury Atlas 9": 275,
    "KH-6 2 (Lanyard 2 - Corona 64 - OPS 0924 - FTV 1110)": 276,
    "TRS 5": 277,
    "Cosmos-17": 278,
    "Cosmos-2I (63S1) operational debris": 279,
    "Cosmos-18": 280,
    "DASH 1": 281,
    "KH-4 21 (Corona 65 - OPS 0954)": 282,
    "Vostok 5": 283,
    "Transit 7": 284,
    "Vostok 6": 285,
    "Surcal 1B": 286,
    "Poppy 2B (NRL-PL 130)": 287,
    "Solrad 6 (Poppy 2A - NRL-PL 110)": 288,
    "Radose (Poppy 2C - NRL-PL 112)": 289,
    "Lofti 2A": 290,
    "Midas solar array cover": 291,
    "Tiros VII": 292,
    "Tiros VII operational debris (despin weight)": 293,
    "TRS 6": 294,
    "KH-4A 22 (Corona 66": 295,
    "Scout X-3 operational debris": 296,
    "GRS": 297,
    "US Air Force Cambridge Research Laboratories": 298,
    "Samos-F2 4 (OPS 1440)": 299,
    "Hitch-hiker 1": 300,
    "TAT Agena B operational debris": 301,
    "Thor Agena D operational debris": 302,
    "KH-7 1 (Gambit-1 1 - OPS 1467)": 303,
    "Atlas LV-3A Agena D operational debris": 304,
    "Agena D (Atlas LV-3A Agena D)": 305,
    "KH-4A 23 (Corona 67 - OPS 1266)": 306,
    "Midas 7 + Atlas LV-3A Agena B stage 2 (Agena B)": 307,
    "DASH 2": 308,
    "KH-6 3 (Lanyard 3 - Corona 68 - OPS 1370)": 309,
    "TAT Agena D operational debris": 310,
    "Westford needles": 311,
    "Midas-7 operational debris (solar array cover)": 312,
    "Cosmos-19": 313,
    "Syncom 2": 314,
    "ERS 9": 315,
    "KH-4A 1 (Corona 69 - OPS 1419)": 316,
    "KH-5 9": 317,
    "Lampo (0.1 Square Meter Target)": 318,
    "KH-5 operational debris": 319,
    "KH-7 2 (Gambit-1 2 - OPS 1947)": 320,
    "TAT Agena D operational debris (fairing adapter)": 321,
    "KH-7 operational debris": 322,
    "KH-4A 2 (Corona 71 - OPS 1353)": 323,
    "Transit 5B-1 (NPP)": 324,
    "SN 39": 325,
    "Cosmos-20": 326,
    "Vela 2": 327,
    "ERS 12": 328,
    "KH-7 3 (Gambit-1 3 - OPS 2196)": 329,
    "KH-5 10": 330,
    "Hitch-hiker 2": 331,
    "Polyot 1": 332,
    "OKB-52 (Chelomey)": 333,
    "Polyot 1 operational debris": 334,
    "Cosmos-21 + stage 4 fully fuelled": 335,
    "Cosmos-22": 336,
    "OKB-1 Filial No. 3": 337,
    "Blok-I (Soyuz SL-4 (A-2))": 338,
    "Vela 1": 339,
    "Explorer 18": 340,
    "CENTAUR C (Atlas LV3C)": 341,
    "NASA Lewis Research Center": 342,
    "KH-4 25 (Corona 74": 343,
    "Atlas LV-3C Centaur D operational debris (payload fairing)": 344,
    "Atlas LV-3C Centaur D fragmentation debris": 345,
    "Transit 5B-2 (NPP)": 346,
    "Transit 5E-3": 347,
    "Cosmos-23": 348,
    "KH-7 4 (Gambit-1 4 - OPS 2372)": 349,
    "Cosmos-24": 350,
    "Explorer 19": 351,
    "Tiros VIII": 352,
    "KH-4 26 (Corona 75 - OPS 1388)": 353,
    "Hitch-hiker 3": 354,
    "Delta B operational debris (despin weight)": 355,
    "Altair 2 (Scout X-4)": 356,
    "Scout X-4 operational debris": 357,
    "GGSE 1": 358,
    "Secor 1 (EGRS 1)": 359,
    "Solrad 7A": 360,
    "Greb 5": 361,
    "OPS 3367A": 362,
    "OPS 3367B": 363,
    "Relay 2": 364,
    "Echo II": 365,
    "Saturn IV": 366,
    "Elektron 1": 367,
    "Ranger 6": 368,
    "Elektron 2": 369,
    "Thor Agena B operational debris (Shroud Half)": 370,
    "Elektron 1 debris": 371,
    "KH-4A 3 (Corona 76 - OPS 3444)": 372,
    "KH-7 5 (Gambit-1 5 - OPS 2423)": 373,
    "KH-4A 3 operational debris (Fairing Adapter)": 374,
    "Atlas LV-3A Agena D stage 2 (Agena D)": 375,
    "Cosmos-25": 376,
    "Samos-F3 1 (OPS 3722)": 377,
    "OPS 3722 operational debris": 378,
    "KH-7 6 (Gambit-1 6 - OPS 3435)": 379,
    "Cosmos-26": 380,
    "Ariel II": 381,
    "UK Dept. of Scientific and Industrial Research": 382,
    "Cosmos-27": 383,
    "Molniya-M Block L operational debris": 384,
    "Cosmos-28": 385,
    "Gemini 1": 386,
    "Polyot 2 operational debris": 387,
    "Polyot 2": 388,
    "Zond 1": 389,
    "KH-7 7 (Gambit-1 7 - OPS 3743)": 390,
    "KH-7 (00786) operational debris": 391,
    "Cosmos-29": 392,
    "KH-4A 5 (Corona 78 - OPS 2921)": 393,
    "Cosmos-30": 394,
    "KH-7 8 (Gambit-1 8 - OPS 3592)": 395,
    "Saturn SA-6": 396,
    "Transit 5C": 397,
    "KH-4A 6 (Corona 79 - OPS 3483)": 398,
    "Cosmos-31": 399,
    "Cosmos-32": 400,
    "KH-5 11": 401,
    "DSAP-1 F8 (P-35 8 - OPS 4467A)": 402,
    "DSAP-1 F9 (P-35 9": 403,
    "KH-4A 7 (Corona 81 - OPS 3754)": 404,
    "Cosmos-33": 405,
    "Starflash 1A operational debris": 406,
    "KH-4A operational debris (fairing)": 407,
    "Cosmos-34": 408,
    "OPS 3395 (Samos-F3 2)": 409,
    "KH-7 9 (Gambit-1 9 - OPS 3684)": 410,
    "OPS 4923 (P-11 4301)": 411,
    "OPS 4923 operational debris": 412,
    "KH-4A 8 (Corona 82 - OPS 3491)": 413,
    "Elektron 3": 414,
    "Elektron 4": 415,
    "Elektron 3 operational debris": 416,
    "Cosmos-35": 417,
    "Vela 3": 418,
    "Vela 4": 419,
    "ERS 13": 420,
    "Ranger 7": 421,
    "Cosmos-36": 422,
    "KH-4A 9 (Corona 83 - OPS 3042)": 423,
    "Cosmos-37": 424,
    "Main Rocket Armaments Directorate": 425,
    "KH-7 10 (Gambit-1 10 - OPS 3802)": 426,
    "OPS 3316 (Hitchhiker 2 - P-11 3)": 427,
    "Agena D (Atlas SLV3)": 428,
    "Cosmos-38": 429,
    "OKB-10 (Reshetnev)": 430,
    "Cosmos-39": 431,
    "Cosmos-40": 432,
    "Cosmos 3 second stage (S3) (Cosmos 1 (65S3))": 433,
    "Cosmos-1 (65S3) operational debris": 434,
    "Syncom 3": 435,
    "KH-5 12": 436,
    "Altair 2 (Delta D)": 437,
    "Cosmos-42": 438,
    "Cosmos-43": 439,
    "Cosmos-41": 440,
    "Explorer 20": 441,
    "Nimbus 1": 442,
    "Cosmos-44": 443,
    "OGO 1": 444,
    "Cosmos-45": 445,
    "KH-4A 10 (Corona 85 - OPS 3497)": 446,
    "Saturn SA-7": 447,
    "KH-7 11 (Gambit-1 11 - OPS 4262)": 448,
    "Cosmos-46": 449,
    "KH-4A operational debris (Fairing)": 450,
    "Explorer 21 (IMP B)": 451,
    "KH-4A 11 (Corona 86 - OPS 3333)": 452,
    "Cosmos-47": 453,
    "Voskhod operational debris": 454,
    "NNS O-1 (Transit 5B-4 )": 455,
    "Blok-L (Molniya)": 456,
    "Explorer 22": 457,
    "Calsphere 1": 458,
    "Transit 5B-4 operational debris": 459,
    "Calsphere 2": 460,
    "Voskhod 1": 461,
    "Cosmos-48": 462,
    "Central Space Forces Directorate": 463,
    "Cosmos-48 operational debris": 464,
    "KH-4A 12 (Corona 87 - OPS 3559)": 465,
    "KH-7 13 (Gambit-1 13 - OPS 4384)": 466,
    "Cosmos-49": 467,
    "OPS 5063": 468,
    "KH-7 operational debris (SRV satellite recovery vehicle)": 469,
    "Cosmos-50": 470,
    "KH-4A 13 (Corona 88 - OPS 5434)": 471,
    "Samos-F3 3 (OPS 3062)": 472,
    "Mariner 3": 473,
    "Explorer 23": 474,
    "OPS 3062 operational debris": 475,
    "KH-4A 14 + Orbis (Corona 89": 476,
    "Explorer 24": 477,
    "Explorer 25": 478,
    "Mariner 4": 479,
    "Zond 2": 480,
    "KH-7 14 (Gambit-1 14": 481,
    "Cosmos-51": 482,
    "Transtage 1 (Titan IIIA)": 483,
    "NNS O-2 debris": 484,
    "San Marco 1": 485,
    "Italian Space Research Commission": 486,
    "Italy": 487,
    "SN 43 (Transit VE-5)": 488,
    "KH-4A 15 (Corona 90 - OPS 3358)": 489,
    "Explorer 26": 490,
    "Quill 1 (OPS 3762 - FTV 2355)": 491,
    "NNS O-2 (Transit 5B-5)": 492,
    "Cosmos-52": 493,
    "KH-4A 16 (Corona 91 - OPS 3928)": 494,
    "DMSP 4A-F1 (OPS 7040)": 495,
    "OPS 7040 operational debris": 496,
    "Tiros IX": 497,
    "Altair 1 (Delta C)": 498,
    "KH-7 15 (Gambit-1 15 - OPS 4703)": 499,
    "Cosmos-53": 500,
    "Southern State Design Bureau": 501,
    "OSO 2": 502,
    "Cosmos-50 fragmentation debris": 503,
    "Titan IIIA stage 3 (Transtage)": 504,
    "Transtage 3 (Titan IIIA)": 505,
    "LES 1": 506,
    "Pegasus 1": 507,
    "Ranger 8": 508,
    "Apollo Model 3": 509,
    "Cosmos-54": 510,
    "Cosmos-55": 511,
    "Cosmos-56": 512,
    "Cosmos-57": 513,
    "KH-4A 17 (Corona 92 - OPS 4782)": 514,
    "Cosmos-58": 515,
    "Cosmos-57 fragmentation debris": 516,
    "Cosmos-59": 517,
    "Voskhod operational debris (Volga airlock)": 518,
    "Secor 3 (EGRS 3)": 519,
    "GGSE 2": 520,
    "Cosmos-60 (Luna 5c) + fully fuelled Block L": 521,
    "KH-7 16 (Gambit-1 16 - OPS 4920)": 522,
    "Secor 2 (EGRS 2)": 523,
    "Atlas SLV-3 Agena D operational debris": 524,
    "Cosmos-61": 525,
    "Cosmos-62": 526,
    "Cosmos-63": 527,
    "Greb 6": 528,
    "Dodecapole 1": 529,
    "DMSP 4A-F2 (OPS 7353)": 530,
    "Voskhod 2": 531,
    "Thor Altair IA operational debris": 532,
    "Altair 3 (Thor-Altair)": 533,
    "Solrad 7B": 534,
    "GGSE 3": 535,
    "OSCAR 3": 536,
    "Ranger 9": 537,
    "Gemini 3": 538,
    "Titan-2-2 (Titan II Gemini)": 539,
    "NNSS 30030 (Transit-O 3 - OPS 7087)": 540,
    "Cosmos-64": 541,
    "KH-4A 18 (Corona 93": 542,
    "Surcal 2": 543,
    "KH-4A operational debris (CORONA Fairing)": 544,
    "Delta C operational debris (despin weight)": 545,
    "Snapshot (NPP) + Atlas SLV-3 Agena D stage 2": 546,
    "U.S. Atomic Energy Commission": 547,
    "Secor 4 (EGRS 4)": 548,
    "Snapshot operational debris (Heat Shield)": 549,
    "Intelsat I F-1 (Early Bird)": 550,
    "International Telecommunications Satellite Organization": 551,
    "Cosmos-65": 552,
    "Molniya 1-1": 553,
    "KH-7 17 (Gambit-1 17 - OPS 4983)": 554,
    "Explorer 27": 555,
    "OPS 6717": 556,
    "KH-4A 19 (Corona 94 - OPS 5023)": 557,
    "KH-7 (01327) operational debris": 558,
    "Cosmos-1 (65S3) fragmentation debris": 559,
    "OPS 6717 operational debris": 560,
    "Transtage 6 (Titan IIIA)": 561,
    "LES 2": 562,
    "LCS 1": 563,
    "Cosmos-66": 564,
    "Luna-5": 565,
    "OPS 5023 payload 2 (SRV 627)": 566,
    "KH-4A 20 (Corona 95 - OPS 8431)": 567,
    "DMSP 4A-F3 (OPS 8386)": 568,
    "Pegasus 2": 569,
    "Cosmos-67": 570,
    "Apollo Model 4": 571,
    "KH-7 18 (Gambit-1 18 - OPS 5236)": 572,
    "Explorer 28 (IMP 3)": 573,
    "Gemini 4": 574,
    "Luna-6": 575,
    "KH-4A 21 (Corona 96 - OPS 8425)": 576,
    "Snapshot fragmentation debris": 577,
    "Cosmos-68": 578,
    "Titan IIIC dummy payload": 579,
    "Transtage 7 (Titan IIIC)": 580,
    "Transit 5B-6 (NNS 30040 - OPS 8480)": 581,
    "Cosmos-69": 582,
    "OPS 6749": 583,
    "KH-7 19 (Gambit-1 19 - OPS 5501)": 584,
    "Thor Ablestar operational debris (NNS adapter)": 585,
    "OPS 6749 operational debris": 586,
    "Tiros X": 587,
    "Environmental Science Services Administration": 588,
    "Cosmos-70": 589,
    "Cosmos-71": 590,
    "Cosmos-72": 591,
    "Cosmos-73": 592,
    "Cosmos-74": 593,
    "Cosmos-75": 594,
    "Proton 1 operational debris (fairing)": 595,
    "OPS 8411 (Samos Ferret)": 596,
    "UR-500 second stage (Proton)": 597,
    "OPS 8411 operational debris": 598,
    "Zond-3": 599,
    "KH-4A 22 (Corona 97 - OPS 5543)": 600,
    "Vela 5": 601,
    "Vela 6": 602,
    "ERS 17": 603,
    "Cosmos-76": 604,
    "Proton 1": 605,
    "Pegasus 3": 606,
    "Apollo Model 5": 607,
    "Cosmos-77": 608,
    "KH-7 21 (Gambit-1 21 - OPS 5698)": 609,
    "OPS 6761": 610,
    "Altair 3 (Scout B-1)": 611,
    "Surveyor D-2": 612,
    "Thor Ablestar operational debris(NRL adapter)": 613,
    "Cosmos-78": 614,
    "Secor 5 (EGRS 5)": 615,
    "Dodecapole 2": 616,
    "Tempsat 1": 617,
    "KH-4A 23 (Corona 98 - OPS 7208)": 618,
    "Transit 5B-7 (OPS 8464)(NNN 0-5)": 619,
    "Navspasur Rod 1": 620,
    "Gemini 5": 621,
    "REP": 622,
    "Titan II Gemini operational debris": 623,
    "Calsphere 4": 624,
    "Thor Ablestar op debris(NRL adapter)(satno change from 1577)": 625,
    "Transit 5B-7 operational debris": 626,
    "Cosmos-79": 627,
    "Transit 5B-1 debris": 628,
    "Cosmos-80 (RTGPP)": 629,
    "Cosmos-81": 630,
    "Cosmos-82": 631,
    "Cosmos-83": 632,
    "Cosmos-84": 633,
    "Vanguard operational debris": 634,
    "Surcal 4 (satno reassigned in 1998 from 1521)": 635,
    "Cosmos-85": 636,
    "DMSP 4A-F4 (OPS 8068)": 637,
    "Thor Altair IA operational debris (yo-yo weight)": 638,
    "Cosmos-86 (RTGPP)": 639,
    "Cosmos-87": 640,
    "Cosmos-88": 641,
    "Cosmos-89": 642,
    "Cosmos-90": 643,
    "KH-4A 24 (Corona 100 - OPS 7221)": 644,
    "Cosmos-91": 645,
    "KH-7 22 (Gambit-1 22 - OPS 7208)": 646,
    "Luna 7": 647,
    "Blok-I (Molniya-M Blok-L)": 648,
    "OV1 2": 649,
    "US Air Force Office of Aerospace Research": 650,
    "KH-4A 25 (Corona 101 - OPS 5325)": 651,
    "OGO 2": 652,
    "Molniya 1-2": 653,
    "Molniya Block L operational debris": 654,
    "Titan IIIC fragmentation debris (Transtage 4)": 655,
    "Cosmos-92": 656,
    "Cosmos-93": 657,
    "COSMOS A-2 (Cosmos 2I (11K63))": 658,
    "Cosmos-2I (11K63) operational debris": 659,
    "Cosmos-94": 660,
    "KH-4A 26 (Corona 102 - OPS 2155)": 661,
    "KH-4A operational debris (LPARL experiment cover)": 662,
    "Titan IIIC debris (Transtage 4) - LCS 2": 663,
    "OV2 1, LCS 2 main fragment": 664,
    "Proton 2": 665,
    "Proton 2 operational debris (fairing)": 666,
    "Proton operational debris": 667,
    "Cosmos-95": 668,
    "Explorer 29": 669,
    "KH-7 23 (Gambit-1 23 - OPS 6232)": 670,
    "FW-4D (Delta E)": 671,
    "Venera 2": 672,
    "Venera 3": 673,
    "Explorer 30": 674,
    "Cosmos-95 debris": 675,
    "Cosmos-96 + fully fuelled Block L": 676,
    "Cosmos-97": 677,
    "Asterix (A 1)": 678,
    "National Space Research Center": 679,
    "France": 680,
    "Cosmos-98": 681,
    "Alouette 2": 682,
    "RUBIS (Diamant A)": 683,
    "Explorer 31": 684,
    "Thor Agena B operational debris (DME-A adapter petal)": 685,
    "Luna 8": 686,
    "Gemini 7": 687,
    "FR 1": 688,
    "KH-4A 27 (Corona 103 - OPS 7249)": 689,
    "Cosmos-99": 690,
    "Titan Transtage (Titan IIIC)": 691,
    "Gemini 6": 692,
    "Pioneer 6": 693,
    "NASA Ames Research Center, Moffett Field": 694,
    "Delta E": 695,
    "Cosmos-100": 696,
    "Gemini 7 adaptor module operational debris": 697,
    "Cosmos-101": 698,
    "Titan Transtage (OV2 3) (Titan IIIC)": 699,
    "Transit 10 (NNS O-6)": 700,
    "Altair 2 (Scout A-1)": 701,
    "KH-4A 28 (Corona 104 - OPS 4639)": 702,
    "Cosmos-102": 703,
    "KB-1 OKB-41 (Savin)": 704,
    "Soviet Navy": 705,
    "Cosmos-103": 706,
    "LES 4": 707,
    "OSCAR 4": 708,
    "Cosmos-104": 709,
    "FR 1 operational debris (despin weight)": 710,
    "Diamant A operational debris": 711,
    "KH-7 24 (Gambit-1 24 - OPS 7253)": 712,
    "LES 3": 713,
    "Cosmos-105": 714,
    "Cosmos-106": 715,
    "Transit 11 (NNS O-7)": 716,
    "Luna 9": 717,
    "Babakin Science and Research Space Center": 718,
    "Institut Kosmicheksiye Issledovaniya": 719,
    "KH-4A 29 (Corona 105 - OPS 7291)": 720,
    "ESSA 1": 721,
    "Heavy Ferret C 2 (OPS 1439)": 722,
    "Cosmos-107": 723,
    "Blok-L (Molniya-M Blok-L)": 724,
    "Cosmos-108": 725,
    "OPS 1439 operational debris": 726,
    "OPS 1184 (KH-7 25, Gambit-1 25)": 727,
    "Scout X-4 expt. cover": 728,
    "OPS 3011 (Bluebell 2C)": 729,
    "OPS 3031 (Bluebell 2S)": 730,
    "Diapason 1A": 731,
    "Cosmos-109": 732,
    "OPS 3031 (Bluebell 2S) fragmentation debris": 733,
    "Cosmos-110": 734,
    "Delta C operational debris (ESSA 1 despin weight)": 735,
    "Scout A operational debris": 736,
    "ESSA 2": 737,
    "Thor Agena B operational debris (Alouette sep clamp)": 738,
    "Cosmos-111": 739,
    "KH-4A 30 (Corona 106": 740,
    "Gemini 8 Target": 741,
    "Gemini 8": 742,
    "Cosmos-112": 743,
    "KH-7 26 (Gambit-1 26 - OPS 0879)": 744,
    "KH-4A 30 operational debris (Fairing)": 745,
    "Cosmos-113": 746,
    "Gemini 8 Equipment Module": 747,
    "ESSA 1 op debris (despin weight)": 748,
    "Transit 12 (NNS O-8)": 749,
    "OV1-4": 750,
    "OV1-5 (BORE)": 751,
    "Boost motor (OV1 5)": 752,
    "Boost motor (OV1 4)": 753,
    "DMSP 4A-F6 (OPS 0340)": 754,
    "Luna 10": 755,
    "Central KB for Experimental Machine Building": 756,
    "Molniya-M Block L operational debris (Otdelyaemiy otsek)": 757,
    "Cosmos-114": 758,
    "KH-4A 31 (Corona 107 - OPS 1612)": 759,
    "Surveyor Model 2": 760,
    "OAO 1": 761,
    "KH-7 27 (Gambit-1 27 - OPS 0910)": 762,
    "Cosmos-115": 763,
    "OV3 1": 764,
    "Molniya 1-3": 765,
    "Cosmos-116": 766,
    "Thor Agena B operational debris (DME-A adapter sep clamp)": 767,
    "Delta C operational debris": 768,
    "Cosmos-117": 769,
    "Cosmos-118": 770,
    "KH-7 28 (Gambit-1 28 - OPS 1950)": 771,
    "OPS 6785": 772,
    "Nimbus 2": 773,
    "Transit 13 (NNS O-9)": 774,
    "KH-4A 33 (Corona 109": 775,
    "Cosmos-119": 776,
    "Explorer 32": 777,
    "Surveyor 1": 778,
    "Gemini 9 Target B (ATDA)": 779,
    "ATLAS MA-5 (Atlas SLV3)": 780,
    "Gemini 9": 781,
    "KH-7 29 (Gambit-1 29 - OPS 1577)": 782,
    "OGO 3": 783,
    "Cosmos-120": 784,
    "OPS 1960": 785,
    "OV3 4": 786,
    "ERS 16": 787,
    "Secor 6 (EGRS 6)": 788,
    "GGTS 1": 789,
    "Scout B operational debris": 790,
    "Cosmos-121": 791,
    "OPS 9311 (IDSCS 1)": 792,
    "OPS 9312 (IDSCS 2)": 793,
    "OPS 9313 (IDSCS 3)": 794,
    "OPS 9314 (IDSCS 4)": 795,
    "OPS 9315 (IDSCS 5)": 796,
    "OPS 9316 (IDSCS 6)": 797,
    "OPS 9317 (IDSCS 7)": 798,
    "Transtage 11 (Titan IIIC)": 799,
    "ESSA 2 op debris (despin weight)": 800,
    "KH-4A 34 (Corona 110 - OPS 1599)": 801,
    "Atlas SLV-3 Agena D fragmentation debris": 802,
    "PAGEOS 1": 803,
    "Cosmos-122": 804,
    "PAGEOS 1 operational debris (canister half)": 805,
    "Explorer 33": 806,
    "KH-4A 34 operational debris (Fairing)": 807,
    "Delta E operational debris (despin weight)": 808,
    "Saturn IVB (S-IB) (Saturn IB)": 809,
    "Proton 3": 810,
    "Apollo 3 AS-203 Nosecone": 811,
    "Proton 3 operational debris (fairing)": 812,
    "Cosmos-123": 813,
    "Saturn IB fragmentation debris": 814,
    "KH-7 30 (Gambit-1 30 - OPS 1850)": 815,
    "OV1 8 (PasComSat)": 816,
    "Cosmos-124": 817,
    "Atlas D operational debris (Container Half)": 818,
    "Explorer 32 op debris (despin weight)": 819,
    "Atlas D operational debris (control assembly)": 820,
    "Gemini 10 Target": 821,
    "Gemini 10": 822,
    "Blok-I (Soyuz 11A510)": 823,
    "Transit 12 operational debris (despin weight)": 824,
    "Titan II Gemini operational debris (ELSS chest pack)": 825,
    "Gemini 10 operational debris (Equipment Module)": 826,
    "Cosmos-126": 827,
    "KH-8 1 (Gambit-3 1 - OPS 3014)": 828,
    "Titan II Gemini operational debris (umbilical bag)": 829,
    "Titan II Gemini operational debris (Hasselblad camera)": 830,
    "OV3 3": 831,
    "Cosmos-127": 832,
    "KH-4A 35 (Corona 111": 833,
    "Lunar Orbiter 1": 834,
    "KH-7 31 (Gambit-1 31 - OPS 1832)": 835,
    "OPS 6810": 836,
    "Pioneer 7": 837,
    "Transit 14 (NNS O-10)": 838,
    "OPS 0856 (RTS-1 2)": 839,
    "Luna 11": 840,
    "Cosmos-128": 841,
    "Secor 7 (EGRS 7)": 842,
    "ERS 15": 843,
    "Gemini 11 Target": 844,
    "Gemini 11": 845,
    "Gemini 11 op debris (Equipment Module)": 846,
    "DMSP 4A-F7 (OPS 6026)": 847,
    "KH-7 32 (Gambit-1 32 - OPS 1686)": 848,
    "OPS 6874": 849,
    "Star 37B (Thor-Burner II)": 850,
    "Surveyor 2": 851,
    "KH-4A 36 (Corona 112 - OPS 1703)": 852,
    "KH-8 2 (Gambit-3 2 - OPS 4096)": 853,
    "KH-4A 36 operational debris (Fairing)": 854,
    "ESSA 3": 855,
    "Cosmos U-1 (OGCh)": 856,
    "R-36-O-2 (Tsyklon SL-10 (F-1r))": 857,
    "Cosmos U-1 fragmentation debris": 858,
    "Cosmos U-1 operational debris (Adapter)": 859,
    "OPS 1920": 860,
    "Cosmos U-1 operational debris (Retro)": 861,
    "KH-7 33 (Gambit-1 33 - OPS 2055)": 862,
    "Cosmos-129": 863,
    "OPS 5345 operational debris": 864,
    "Molniya 1-4": 865,
    "Cosmos-130": 866,
    "Luna 12": 867,
    "Surveyor Model 3": 868,
    "Intelsat II F-1": 869,
    "OV3 2": 870,
    "ESSA 3 op debris (despin weight)": 871,
    "Secor 8 (EGRS 8)": 872,
    "KH-7 34 (Gambit-1 34 - OPS 2070)": 873,
    "OV4 3 (MOL Canister) + Transtage": 874,
    "OV4 1R": 875,
    "OV1 6": 876,
    "OV4 1T": 877,
    "LES 2 operational debris (AKM)": 878,
    "Lunar Orbiter 2": 879,
    "Cosmos U-2 warhead(OGCh)": 880,
    "KH-4A 37 (Corona 113 - OPS 1866)": 881,
    "Cosmos U-2 op debris (Adapter)": 882,
    "Cosmos U-2 fragmentation debris": 883,
    "Gemini 12 Target": 884,
    "Gemini 12": 885,
    "Cosmos-131": 886,
    "Gemini 12 adaptor module": 887,
    "Cosmos-132": 888,
    "Cosmos-133": 889,
    "Blok-I (Soyuz 11A511)": 890,
    "Cosmos-134": 891,
    "KH-7 35 (Gambit-1 35 - OPS 1890)": 892,
    "ATS 1": 893,
    "OV1 9": 894,
    "OV1 10": 895,
    "Cosmos-135": 896,
    "KH-8 3 (Gambit-3 3 - OPS 8968)": 897,
    "Biosat 1 op debris (Adapter)": 898,
    "Boost motor (OV1 10)": 899,
    "Boost motor (OV1 9)": 900,
    "Delta E (Delta G)": 901,
    "Cosmos-136": 902,
    "Luna 13": 903,
    "Cosmos-137": 904,
    "Molniya-M Block L stage 4 casing": 905,
    "Biosatellite 1": 906,
    "OPS 1584 (Heavy Ferret C 3)": 907,
    "OPS 1584 operational debris": 908,
    "Intelsat II F-2": 909,
    "KH-4B 38 (Corona 114 - OPS 1664)": 910,
    "OPS 9321 (IDSCS 8)": 911,
    "Cosmos-138": 912,
    "OPS 9322 (IDSCS 9)": 913,
    "OPS 9323 (IDSCS 10)": 914,
    "OPS 9324 (IDSCS 11)": 915,
    "OPS 9325 (IDSCS 12)": 916,
    "OPS 9326 (IDSCS 13)": 917,
    "OPS 9327 (IDSCS 14)": 918,
    "OPS 9328 (IDSCS 15)": 919,
    "Cosmos-139": 920,
    "ESSA 4": 921,
    "Tsyklon-2r op debris (platform + Cosmos-139 Adapter)": 922,
    "Transtage 13 (Titan IIIC)": 923,
    "KH-4B 38 operational debris (Fairing)": 924,
    "KH-7 36 (Gambit-1 36 - OPS 4399)": 925,
    "Lunar Orbiter 3": 926,
    "Cosmos-140": 927,
    "DMSP 4A-F8 (OPS 6073)": 928,
    "Cosmos-141": 929,
    "Diademe 1": 930,
    "Cosmos-142": 931,
    "Diademe 2": 932,
    "KH-4B 39 (Corona 115 - OPS 4750)": 933,
    "KH-8 4 (Gambit-3 4 - OPS 4204)": 934,
    "Cosmos-143": 935,
    "Cosmos-144": 936,
    "Cosmos-145": 937,
    "OSO 3": 938,
    "Cosmos-146 (Zond)": 939,
    "Cosmos-135 operational debris": 940,
    "Proton-K/DM-2 ullage motor (SOZ)": 941,
    "Cosmos-147": 942,
    "Cosmos-148": 943,
    "Cosmos-149": 944,
    "Cosmos-150": 945,
    "Intelsat II F-3": 946,
    "Cosmos-151": 947,
    "Cosmos 3 second stage (S3) (Cosmos 3 (11K65))": 948,
    "Cosmos-152": 949,
    "KH-4B 40 (Corona 116 - OPS 4779)": 950,
    "Cosmos-153": 951,
    "ATS 2": 952,
    "Proton-K/D ullage motor (SOZ)": 953,
    "Cosmos-154": 954,
    "Cosmos-155": 955,
    "Transit 15 (NNS O-12)": 956,
    "Surveyor 3": 957,
    "ESSA 5": 958,
    "Soyuz 1": 959,
    "San Marco 2": 960,
    "Cosmos-156": 961,
    "Vela 7": 962,
    "Vela 8": 963,
    "ERS 18": 964,
    "OV5 3 (ERS 20)": 965,
    "OV5 1 (ERS 27)": 966,
    "Transtage 10 (Titan IIIC)": 967,
    "Lunar Orbiter 4": 968,
    "Ariel III": 969,
    "UK Science Research Council": 970,
    "Cosmos-3 (11K65) operational debris": 971,
    "Transit 15 operational debris (despin weight)": 972,
    "KH-4B 41 (Corona 117 - OPS 4696)": 973,
    "Hitch-hiker 14 (OPS 1967)": 974,
    "Cosmos-157": 975,
    "Transit VE-5 fragmentation debris": 976,
    "Cosmos-158": 977,
    "Cosmos 3 second stage (S3) (Cosmos 3M (11K65M))": 978,
    "Cosmos-159": 979,
    "Cosmos-160": 980,
    "Transit 16 (NNS O-13)": 981,
    "Cosmos-161": 982,
    "KH-7 37 (Gambit-1 37)": 983,
    "Proton-K 8S812 (Proton-K/D)": 984,
    "Explorer 34 (IMP 4)": 985,
    "Molniya 1-5": 986,
    "Cosmos-158 debris": 987,
    "KH-4B 41 operational debris (Fairing)": 988,
    "OPS 5712 payload 160 (Calsphere IV)": 989,
    "Cosmos-162": 990,
    "GGSE 4": 991,
    "KH-7 38 (Gambit-1 38 - OPS 4360)": 992,
    "Cosmos-163": 993,
    "GGSE 5": 994,
    "Cosmos-164": 995,
    "Blok-I (Molniya-M Blok-VL)": 996,
    "Venera 4": 997,
    "Cosmos-165": 998,
    "Mariner 5": 999,
    "Timation 1": 1000,
    "Cosmos-166": 1001,
    "KH-4B 42 (Corona 118 - OPS 3559)": 1002,
    "OPS 1873": 1003,
    "Cosmos-167": 1004,
    "Blok-VL (Molniya-M Blok-VL)": 1005,
    "KH-8 6 (Gambit-3 6 - OPS 4282)": 1006,
    "Secor 9 (EGRS 9)": 1007,
    "OPS 9331 (IDSCS 16)": 1008,
    "OPS 9332 (IDSCS 17)": 1009,
    "OPS 9333 (IDSCS 18)": 1010,
    "OPS 9334 (IDSCS 19, DATS)": 1011,
    "LES 5": 1012,
    "DODGE 1": 1013,
    "USN Naval Air Systems Command (NAVAIR)": 1014,
    "Transtage 14 (Titan IIIC)": 1015,
    "Cosmos-168": 1016,
    "Surcal 159 (Calsphere III)": 1017,
    "OPS 5712 payload 152 (NRL PL151)": 1018,
    "OPS 5712 payload 153 (NRL PL153)": 1019,
    "Surveyor 4": 1020,
    "Aurora 1": 1021,
    "Star 13A (Thor-Burner II)": 1022,
    "Cosmos-169": 1023,
    "Tsyklon-2r platform": 1024,
    "Tsyklon-2r operational debris": 1025,
    "Explorer 35": 1026,
    "OPS 1879 (Heavy Ferret C 4)": 1027,
    "OPS 1879 operational debris": 1028,
    "OV1 86": 1029,
    "Boost motor (OV1 86)": 1030,
    "OGO 4": 1031,
    "Boost motor (OV1 12)": 1032,
    "OV1 12": 1033,
    "Cosmos-170": 1034,
    "Lunar Orbiter 5": 1035,
    "Surcal 150B (NRL PL150B)": 1036,
    "KH-4A 43  (Corona 119 - OPS 4827)": 1037,
    "Cosmos-171 (OGCh)": 1038,
    "Kosmos-171 Adapter": 1039,
    "Cosmos-172": 1040,
    "OV1 86 operational debris": 1041,
    "KH-8 7 (Gambit-3 7 - OPS 4886)": 1042,
    "DMSP 4A-F9 (OPS 7202)": 1043,
    "Cosmos-173": 1044,
    "KH-4B 43 operational debris (Fairing)": 1045,
    "Molniya-M fourth stage (Block L)": 1046,
    "Cosmos-174": 1047,
    "Transit 5B-2 operational debris": 1048,
    "Cosmos U-2 op debris (OGCh Retro)": 1049,
    "Biosatellite 2": 1050,
    "Surveyor 5": 1051,
    "CENTAUR D/E (Atlas SLV3C)": 1052,
    "Cosmos-175": 1053,
    "Cosmos-176": 1054,
    "KH-4B 1 (Corona 120 - OPS 5089)": 1055,
    "Cosmos-177": 1056,
    "Cosmos-178": 1057,
    "KH-8 8 (Gambit-3 8 - OPS 4941)": 1058,
    "Cosmos-176 operational debris": 1059,
    "Cosmos-179": 1060,
    "Transit 17 (NNS O-14)": 1061,
    "Cosmos-180": 1062,
    "Intelsat II F-4": 1063,
    "Molniya 1-6": 1064,
    "DMSP 4A-F10 (OPS 1264)": 1065,
    "Cosmos-181": 1066,
    "Cosmos-182": 1067,
    "OSO 4": 1068,
    "Cosmos-183": 1069,
    "Molniya 1-7": 1070,
    "Cosmos-184": 1071,
    "KH-8 9 (Gambit-3 9 - OPS 4995)": 1072,
    "Cosmos-185": 1073,
    "Space Defence Force, USSR Armed Forces": 1074,
    "Cosmos-186": 1075,
    "Cosmos-187": 1076,
    "Tsiklon 2-2 (Tsyklon SL-11 (F-1m))": 1077,
    "Cosmos-188": 1078,
    "Cosmos-189": 1079,
    "KH-4B 44 (Corona 121 - OPS 0562)": 1080,
    "OPS 1587": 1081,
    "Cosmos-190": 1082,
    "Cosmos-189 debris": 1083,
    "ATS 3": 1084,
    "Surveyor 6": 1085,
    "Apollo 4": 1086,
    "Saturn IVB (S-V) (Saturn V)": 1087,
    "ESSA 6": 1088,
    "Cosmos-191": 1089,
    "Cosmos-192": 1090,
    "Cosmos-193": 1091,
    "WRESAT 1": 1092,
    "Weapons Research Establishment": 1093,
    "Australia": 1094,
    "Cosmos-194": 1095,
    "OV3 6": 1096,
    "KH-8 10 (Gambit-3 10": 1097,
    "KH-4B 2 (Corona 122 - OPS 1001)": 1098,
    "Pioneer 8": 1099,
    "TETR 1 (TTS 1)": 1100,
    "Cosmos-195": 1101,
    "Cosmos-196": 1102,
    "Cosmos-197": 1103,
    "Cosmos-198 (NPP)": 1104,
    "Cosmos-198 (PELPS (propulsion system))": 1105,
    "Cosmos-198 (SLR radar antenna)": 1106,
    "Surveyor 7": 1107,
    "Explorer 36 (Geos 2)": 1108,
    "OPS 1965 (Heavy Ferret C 5)": 1109,
    "KH-8 11 (Gambit-3 11": 1110,
    "Cosmos-199 equipment bay (Priborniy otsek)": 1111,
    "Cosmos-200": 1112,
    "TsNII-108 GKRE (Zaslavskiy)": 1113,
    "OPS 1965 operational debris": 1114,
    "Cosmos-200 debris": 1115,
    "Apollo 5 (LM 1 Ascent Stage)": 1116,
    "Apollo 5 (LM 1 Descent Stage)": 1117,
    "KH-4B 45 (Corona 123 - OPS 2243)": 1118,
    "OPS 6236": 1119,
    "Cosmos-199": 1120,
    "Cosmos-201": 1121,
    "KH-4B 45 operational debris (Fairing)": 1122,
    "Midas-7 debris": 1123,
    "Explorer 36 operational debris (despin weight)": 1124,
    "Cosmos-202": 1125,
    "Cosmos-203": 1126,
    "Transit 18 (NNS O-18)": 1127,
    "Zond 4": 1128,
    "Proton-K/D fourth stage casing": 1129,
    "OGO 5": 1130,
    "Cosmos-204": 1131,
    "Cosmos-205": 1132,
    "Explorer 37 (SR 9)": 1133,
    "Proton-K/D operational debris (SOK)": 1134,
    "Agena D (Atlas SLV3A)": 1135,
    "Cosmos-203 debris": 1136,
    "KH-8 12 (Gambit-3 12": 1137,
    "Cosmos-206": 1138,
    "KH-4B 46 (Corona 124 - OPS 4849)": 1139,
    "OPS 7076": 1140,
    "Cosmos-207": 1141,
    "Cosmos-208": 1142,
    "TsKBEM Filial No. 3": 1143,
    "Cosmos-209 (NPP)": 1144,
    "Tsyklon-2 operational debris": 1145,
    "Tsyklon-2 platform": 1146,
    "Cosmos-208 instrument package": 1147,
    "Cosmos-210": 1148,
    "Apollo 6": 1149,
    "Cosmos-210 operational debris": 1150,
    "OV1 13": 1151,
    "OV1 14": 1152,
    "Boost motor (OV1 14)": 1153,
    "Luna 14": 1154,
    "Cosmos-211": 1155,
    "Cosmos-212": 1156,
    "Saturn V fragmentation debris": 1157,
    "Cosmos-213": 1158,
    "KH-8 13 (Gambit-3 13 - OPS 5105)": 1159,
    "Cosmos-214": 1160,
    "Cosmos-215": 1161,
    "Cosmos-216": 1162,
    "Molniya 1-8": 1163,
    "Blok-I (Molniya-M Blok-ML)": 1164,
    "Boost motor (OV1 13)": 1165,
    "Cosmos-217": 1166,
    "Cosmos-218": 1167,
    "Cosmos-219": 1168,
    "LTTAT Agena D stage 2 (Agena D) Fairing": 1169,
    "Cosmos-220": 1170,
    "Cosmos-220 debris": 1171,
    "KH-4B 3 (Corona 125)(OPS 1419)": 1172,
    "Iris (ESRO 2)": 1173,
    "European Space Research and Technology Centre": 1174,
    "European Space Research Organization": 1175,
    "DMSP 5A-F1 (OPS 7869)": 1176,
    "Cosmos-221": 1177,
    "Cosmos-222": 1178,
    "Cosmos-223": 1179,
    "Cosmos-224": 1180,
    "KH-8 14 (Gambit-3 14 - OPS 5138)": 1181,
    "Cosmos-225": 1182,
    "Cosmos-226": 1183,
    "Meteorological Service": 1184,
    "OPS 9341 (IDSCS 20)": 1185,
    "OPS 9342 (IDSCS 21)": 1186,
    "OPS 9343 (IDSCS 22)": 1187,
    "OPS 9344 (IDSCS 23)": 1188,
    "OPS 9345 (IDSCS 24)": 1189,
    "OPS 9346 (IDSCS 25)": 1190,
    "OPS 9347 (IDSCS 26)": 1191,
    "OPS 9348 (IDSCS 27)": 1192,
    "Transtage 16 (Titan IIIC)": 1193,
    "Cosmos-227": 1194,
    "KH-4B 47 (Corona 126 - OPS 5343)": 1195,
    "OPS 5259": 1196,
    "Cosmos-228": 1197,
    "Cosmos-229": 1198,
    "Cosmos-228 instrument package": 1199,
    "Explorer 38 (RAE 1)": 1200,
    "Cosmos-230": 1201,
    "Molniya 1-9": 1202,
    "Star 37D (Delta J)": 1203,
    "Cosmos-231": 1204,
    "OV1 15": 1205,
    "LOADS (OV1 16)": 1206,
    "Boost motor (OV1 15)": 1207,
    "Boost motor (OV1 16)": 1208,
    "Cosmos-232": 1209,
    "Cosmos-233": 1210,
    "Cosmos-234": 1211,
    "OPS 2222 (CANYON 1)": 1212,
    "KH-8 (03335)": 1213,
    "KH-4B (03336)": 1214,
    "Explorer 39": 1215,
    "Explorer 40": 1216,
    "Cosmos-235": 1217,
    "ATS 4": 1218,
    "ESSA 7": 1219,
    "Delta E (Delta N)": 1220,
    "Cosmos-236": 1221,
    "Cosmos-237": 1222,
    "Cosmos-238": 1223,
    "Cosmos-239": 1224,
    "KH-8 (03375)": 1225,
    "Cosmos-240": 1226,
    "Zond 5": 1227,
    "Proton-K/D operational debris": 1228,
    "Cosmos-241": 1229,
    "KH-4B (03408)": 1230,
    "OPS 8595": 1231,
    "Cosmos-242": 1232,
    "Delta N operational debris": 1233,
    "Cosmos-243": 1234,
    "OV2-5 (DG7-2)": 1235,
    "ERS 28 (OV5-4)": 1236,
    "ERS 21 (OV5-2)": 1237,
    "LES 6": 1238,
    "Transtage 5 (Titan IIIC)": 1239,
    "Cosmos-244": 1240,
    "Cosmos-243 instrument package": 1241,
    "Cosmos-245": 1242,
    "Aurorae (ESRO 1A)": 1243,
    "Molniya 1-10": 1244,
    "OPS 0964": 1245,
    "Cosmos-246": 1246,
    "ESRO 1A despin weight": 1247,
    "Cosmos-247": 1248,
    "Apollo 7": 1249,
    "Cosmos-248": 1250,
    "Cosmos-249": 1251,
    "Cosmos-249 fragmentation debris": 1252,
    "DMSP 5A-F2": 1253,
    "Soyuz 2": 1254,
    "Blok-ML (Molniya-M Blok-ML)": 1255,
    "Soyuz 3": 1256,
    "Cosmos-250": 1257,
    "Cosmos-251": 1258,
    "Cosmos-252": 1259,
    "KH-4B (03531)": 1260,
    "KH-8 (03532)": 1261,
    "Pioneer 9": 1262,
    "TETR 2": 1263,
    "Zond 6": 1264,
    "Cosmos-251 operational debris": 1265,
    "Cosmos-253": 1266,
    "Proton-4": 1267,
    "Proton-K 8S812": 1268,
    "Cosmos-252 fragmentation debris": 1269,
    "Cosmos-254": 1270,
    "Cosmos-248 fragmentation debris": 1271,
    "Cosmos-255": 1272,
    "Cosmos-256": 1273,
    "Cosmos-257": 1274,
    "Transit 12 fragmentation debris (insulation)": 1275,
    "KH-8 (03594)": 1276,
    "HEOS 1": 1277,
    "OAO 2": 1278,
    "Cosmos-258": 1279,
    "KH-4B (03604)": 1280,
    "OPS 7684": 1281,
    "OV1 5 operational debris": 1282,
    "Cosmos-259": 1283,
    "ESSA 8": 1284,
    "OPS 7684 operational debris": 1285,
    "Cosmos-260": 1286,
    "Intelsat III F-2": 1287,
    "Cosmos-261": 1288,
    "Apollo 8": 1289,
    "Cosmos-262": 1290,
    "Venera 5": 1291,
    "Venera 6": 1292,
    "Cosmos-263": 1293,
    "Soyuz 4": 1294,
    "Soyuz 5": 1295,
    "Soyuz 11A511 operational debris": 1296,
    "Cosmos-250 debris": 1297,
    "OSO 5": 1298,
    "KH-8 (03665)": 1299,
    "KH-8 (03665) operational debris": 1300,
    "Cosmos-264": 1301,
    "ISIS 1": 1302,
    "Communications Research Center": 1303,
    "KH-4B (03672)": 1304,
    "OPS 2644": 1305,
    "Intelsat III F-3": 1306,
    "Cosmos-265": 1307,
    "TACSAT 1": 1308,
    "Transtage 17 (Titan IIIC)": 1309,
    "Explorer 11 operational debris": 1310,
    "Diademe 1 operational debris": 1311,
    "Explorer 23 operational debris": 1312,
    "Mariner 6": 1313,
    "Cosmos-266": 1314,
    "ESSA 9": 1315,
    "Cosmos-267": 1316,
    "Apollo 9": 1317,
    "Apollo 9 LM (APS)": 1318,
    "KH-8 (03772)": 1319,
    "Cosmos-268": 1320,
    "Cosmos-269": 1321,
    "Cosmos-270": 1322,
    "Cosmos 3 debris": 1323,
    "Apollo 9 LM (DPS)": 1324,
    "Cosmos-271": 1325,
    "Cosmos-272": 1326,
    "OV1 17": 1327,
    "OV1 18": 1328,
    "OV1 19": 1329,
    "OV1 17A": 1330,
    "Boost motor (OV1 19)": 1331,
    "Boost motor (OV1 18)": 1332,
    "KH-4B (03829)": 1333,
    "OPS 2285": 1334,
    "Cosmos-273": 1335,
    "Cosmos-274": 1336,
    "Meteor 1-1": 1337,
    "Mariner 7": 1338,
    "OPS 2644 operational debris": 1339,
    "Cosmos-275": 1340,
    "Explorer38 op deb(Star 17 apogee motor)": 1341,
    "Vostok fragmentation debris": 1342,
    "Cosmos-276": 1343,
    "Cosmos-277": 1344,
    "Cosmos-278": 1345,
    "Molniya 1-11": 1346,
    "OPS 3148 (CANYON 2)": 1347,
    "Nimbus 3 (NPP)": 1348,
    "Secor 13": 1349,
    "US Army Topographic Command": 1350,
    "Agena D (Thorad-Agena D)": 1351,
    "Cosmos-279": 1352,
    "KH-8 (03895)": 1353,
    "Cosmos-280": 1354,
    "KH-4B (03914)": 1355,
    "OPS 1721": 1356,
    "Cosmos-280 operational debris": 1357,
    "Cosmos-281": 1358,
    "Apollo 10 CM (Charlie Brown)": 1359,
    "KH-4B (03914) operational debris": 1360,
    "Cosmos-282": 1361,
    "Intelsat III F-4": 1362,
    "Apollo 10 LM (DPS)": 1363,
    "Apollo 10 LM (APS) (Snoopy)": 1364,
    "OV5 (ERS 29)": 1365,
    "OV6 (ERS 26)": 1366,
    "OV5 9": 1367,
    "Vela 9": 1368,
    "Vela 10": 1369,
    "Transtage 15 (Titan IIIC)": 1370,
    "Cosmos-283": 1371,
    "Cosmos-284": 1372,
    "Cosmos-285": 1373,
    "KH-8 (03984)": 1374,
    "OGO 6": 1375,
    "Cosmos-286": 1376,
    "Explorer 41": 1377,
    "Cosmos-287": 1378,
    "Cosmos-288": 1379,
    "Titan IIIC debris (Transtage 8)": 1380,
    "Biosatellite 3": 1381,
    "Cosmos-289": 1382,
    "Luna-15 KT": 1383,
    "Apollo 11 CM (Columbia)": 1384,
    "Apollo 11 LM Eagle (APS)": 1385,
    "Cosmos-290": 1386,
    "Molniya 1-12": 1387,
    "DMSP 5A-F3": 1388,
    "KH-4B (04050)": 1389,
    "Intelsat III F-5": 1390,
    "Delta M fragmentation debris": 1391,
    "Star 37D (Delta M)": 1392,
    "OPS 8285": 1393,
    "Cosmos-291": 1394,
    "Zond 7": 1395,
    "OSO 6": 1396,
    "PAC 1": 1397,
    "ATS 5": 1398,
    "Cosmos-292": 1399,
    "Cosmos-293": 1400,
    "Cosmos-294": 1401,
    "Cosmos-295": 1402,
    "KH-8 (04078)": 1403,
    "Cosmos-296": 1404,
    "Cosmos-297": 1405,
    "Cosmos-292 debris": 1406,
    "Cosmos-298": 1407,
    "Cosmos-299": 1408,
    "KH-4B (04102)": 1409,
    "OPS 4710": 1410,
    "Cosmos-300": 1411,
    "Cosmos-301": 1412,
    "WESTON (OPS 1807)": 1413,
    "Agena D debris": 1414,
    "WESTON operational debris (antenna cover)": 1415,
    "Boreas (ESRO 1B)": 1416,
    "ESRO 1B despin weight": 1417,
    "Meteor 1-2": 1418,
    "OV1 18 operational debris": 1419,
    "Soyuz 6": 1420,
    "Soyuz 7": 1421,
    "Soyuz 8": 1422,
    "Intercosmos 1": 1423,
    "Interkosmos": 1424,
    "Cosmos-302": 1425,
    "SOICAL cone": 1426,
    "Cosmos-303": 1427,
    "Cosmos-304": 1428,
    "SOICAL cylinder": 1429,
    "Tempsat 2": 1430,
    "Cosmos-306": 1431,
    "Cosmos-307": 1432,
    "KH-8 (04186)": 1433,
    "Cosmos-308": 1434,
    "Azur": 1435,
    "German Test and Research Institute for Aviation and Space Flight": 1436,
    "Germany": 1437,
    "Cosmos-309": 1438,
    "Apollo 12": 1439,
    "Cosmos-310": 1440,
    "Cosmos-309 operational debris": 1441,
    "Cosmos-309 Capsule": 1442,
    "OPS 7613 payload 4": 1443,
    "Apollo 12 LM (APS)": 1444,
    "OPS 7613 payload 5": 1445,
    "Skynet 1A": 1446,
    "Ministry of Defence, London": 1447,
    "Cosmos-311": 1448,
    "Cosmos-312": 1449,
    "Timation 2": 1450,
    "OPS 7613 payload 3": 1451,
    "Cosmos-313": 1452,
    "KH-4B (04264)": 1453,
    "Cosmos-314": 1454,
    "Cosmos-315": 1455,
    "Cosmos-315 debris": 1456,
    "Cosmos-317": 1457,
    "Cosmos-316": 1458,
    "Cosmos-316 operational debris": 1459,
    "Intercosmos 2": 1460,
    "Cosmos-317 engine": 1461,
    "Cosmos-317 operational debris": 1462,
    "Cosmos-318": 1463,
    "OPS 7613 payload 6": 1464,
    "KH-8 (04296)": 1465,
    "Intelsat III F-6": 1466,
    "Cosmos-319": 1467,
    "Cosmos-320": 1468,
    "Cosmos-321": 1469,
    "Cosmos-322": 1470,
    "ITOS 1": 1471,
    "National Oceanic and Atmospheric Administration": 1472,
    "OSCAR 5": 1473,
    "Melbourne Uni./Australis": 1474,
    "Delta E (Delta N6)": 1475,
    "SERT 2": 1476,
    "Cosmos-323": 1477,
    "Ohsumi": 1478,
    "Institute of Space and Aeronautical Sciences": 1479,
    "Japan": 1480,
    "DMSP 5A-F4": 1481,
    "Molniya 1-13": 1482,
    "Cosmos-324": 1483,
    "Cosmos-325": 1484,
    "Main Space Forces Directorate": 1485,
    "KH-4B (04342)": 1486,
    "OPS 3402": 1487,
    "DIAL - WIKA": 1488,
    "Ministry of Education and Science": 1489,
    "EUROPA II PERIGEE SYSTEM (Diamant B)": 1490,
    "Cosmos-326": 1491,
    "Meteor 1-3": 1492,
    "Cosmos-327": 1493,
    "NATO I": 1494,
    "North Atlantic Treaty Organization": 1495,
    "Cosmos-328": 1496,
    "Cosmos-329": 1497,
    "Cosmos-330": 1498,
    "Nimbus 4": 1499,
    "TOPO 1": 1500,
    "Cosmos-331": 1501,
    "Vela 12": 1502,
    "Vela 11": 1503,
    "Cosmos-332": 1504,
    "Apollo 13": 1505,
    "Cosmos-333": 1506,
    "KH-8 (04375)": 1507,
    "Intelsat III F-7": 1508,
    "Cosmos-334": 1509,
    "Cosmos-335": 1510,
    "Dong Fang Hong 1": 1511,
    "Ministry of Aviation Industry": 1512,
    "China": 1513,
    "Cosmos-336": 1514,
    "Cosmos-337": 1515,
    "Cosmos-338": 1516,
    "Cosmos-339": 1517,
    "Cosmos-340": 1518,
    "Cosmos-341": 1519,
    "Cosmos-342": 1520,
    "Cosmos-343": 1521,
    "CZ-1 third stage (Long March (CZ) 1)": 1522,
    "Meteor 1-4": 1523,
    "Cosmos-333 engine": 1524,
    "Cosmos-333 operational debris": 1525,
    "Cosmos-334 operational debris": 1526,
    "CZ-1 operational debris": 1527,
    "Cosmos-344": 1528,
    "Cosmos-345": 1529,
    "KH-4B (04405)": 1530,
    "OPS 8520": 1531,
    "Soyuz 9": 1532,
    "Cosmos-346": 1533,
    "Cosmos-347": 1534,
    "Cosmos-348": 1535,
    "Cosmos-349": 1536,
    "OPS 5346 (Rhyolite 1)": 1537,
    "Meteor 1-5": 1538,
    "KH-8 (04422)": 1539,
    "Cosmos-350": 1540,
    "Cosmos-351": 1541,
    "Molniya 1-14": 1542,
    "Cosmos-352": 1543,
    "Cosmos-353": 1544,
    "KH-4B (04477)": 1545,
    "Intelsat III F-8": 1546,
    "Cosmos-354": 1547,
    "Intercosmos 3": 1548,
    "Cosmos-355": 1549,
    "Cosmos-356": 1550,
    "Venera 7": 1551,
    "Blok-I (Molniya-M Blok-MVL)": 1552,
    "KH-8 (04492)": 1553,
    "Skynet 1B": 1554,
    "Cosmos-357": 1555,
    "Cosmos-358": 1556,
    "Cosmos-359": 1557,
    "OPS 8329": 1558,
